// jshint ignore: start
+function ($) {

    $.rawCitiesData = [
        {
            "name": "北京",
            "code": "11",
            "sub": [
                {
                    "name": "北京",
                    "code": "1000",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                }
            ]
        },
        {
            "name": "广西壮族自治区",
            "code": "6100",
            "sub": [
                {
                    "name": "东兰",
                    "code": "6288",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "巴马瑶族自治",
                    "code": "6289",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "都安瑶族自治",
                    "code": "6291",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "大化瑶族自治",
                    "code": "6292",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "钦州",
                    "code": "6310",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "灵山",
                    "code": "6314",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "浦北",
                    "code": "6315",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "东兴",
                    "code": "6322",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "贵港",
                    "code": "6330",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "平南",
                    "code": "6331",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "桂平",
                    "code": "6332",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "贺州",
                    "code": "6340",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "昭平",
                    "code": "6341",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "钟山",
                    "code": "6342",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "富川瑶族自治",
                    "code": "6343",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "来宾",
                    "code": "6350",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "防城港",
                    "code": "6320",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "上思",
                    "code": "6321",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "忻城",
                    "code": "6351",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "象州",
                    "code": "6352",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "武宣",
                    "code": "6353",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "金秀瑶族自治",
                    "code": "6354",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "合山",
                    "code": "6355",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "崇左",
                    "code": "6360",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "扶绥",
                    "code": "6361",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宁明",
                    "code": "6362",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "龙州",
                    "code": "6363",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "大新",
                    "code": "6364",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "天等",
                    "code": "6365",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "凭祥",
                    "code": "6366",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "南宁",
                    "code": "6110",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "武鸣",
                    "code": "6112",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "横县",
                    "code": "6122",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宾阳",
                    "code": "6123",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "上林",
                    "code": "6124",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "隆安",
                    "code": "6125",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "马山",
                    "code": "6126",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "柳州",
                    "code": "6140",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "柳江",
                    "code": "6141",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "柳城",
                    "code": "6142",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "鹿寨",
                    "code": "6152",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "融安",
                    "code": "6156",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "三江侗族自治",
                    "code": "6157",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "融水苗族自治",
                    "code": "6158",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "桂林",
                    "code": "6170",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阳朔",
                    "code": "6171",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "临桂",
                    "code": "6172",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "灵川",
                    "code": "6181",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "全州",
                    "code": "6182",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "兴安",
                    "code": "6183",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "永福",
                    "code": "6184",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "灌阳",
                    "code": "6185",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "龙胜各族自治",
                    "code": "6186",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "资源",
                    "code": "6187",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "平乐",
                    "code": "6188",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "荔蒲",
                    "code": "6189",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "恭城瑶族自治",
                    "code": "6191",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "梧州",
                    "code": "6210",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "苍梧",
                    "code": "6211",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "岑溪",
                    "code": "6221",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "藤县",
                    "code": "6222",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "蒙山",
                    "code": "6224",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "北海",
                    "code": "6230",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "合浦",
                    "code": "6231",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "玉林",
                    "code": "6240",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "容县",
                    "code": "6245",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "北流",
                    "code": "6246",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "陆川",
                    "code": "6247",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "博白",
                    "code": "6248",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "兴业",
                    "code": "6249",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "百色",
                    "code": "6260",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "田阳",
                    "code": "6262",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "田东",
                    "code": "6263",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "平果",
                    "code": "6264",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "德保",
                    "code": "6265",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "靖西",
                    "code": "6266",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "那坡",
                    "code": "6267",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "凌云",
                    "code": "6268",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "乐业",
                    "code": "6269",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "田林",
                    "code": "6271",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "隆林各族自治",
                    "code": "6272",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "西林",
                    "code": "6273",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "河池",
                    "code": "6280",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宜州",
                    "code": "6282",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "罗城仫佬族自治",
                    "code": "6283",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "环江毛南族自治",
                    "code": "6284",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "南丹",
                    "code": "6285",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "天峨",
                    "code": "6286",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "凤山",
                    "code": "6287",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                }
            ]
        },
        {
            "name": "内蒙古自治区",
            "code": "1900",
            "sub": [
                {
                    "name": "呼和浩特",
                    "code": "1910",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "土默特左旗",
                    "code": "1911",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "托克托",
                    "code": "1912",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "武川",
                    "code": "1913",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "和林格尔",
                    "code": "1914",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "清水河",
                    "code": "1915",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "包头",
                    "code": "1920",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "土默特右旗",
                    "code": "1921",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "固阳",
                    "code": "1922",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "达尔罕茂明安联合旗",
                    "code": "1923",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "乌海",
                    "code": "1930",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "赤峰",
                    "code": "1940",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阿鲁科尔沁旗",
                    "code": "1941",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "巴林左旗",
                    "code": "1942",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "巴林右旗",
                    "code": "1943",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "林西",
                    "code": "1944",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "克什克腾旗",
                    "code": "1945",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "翁牛特旗",
                    "code": "1946",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "喀喇沁旗",
                    "code": "1947",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宁城",
                    "code": "1948",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "敖汉旗",
                    "code": "1949",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "呼伦贝尔",
                    "code": "1960",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "满洲里",
                    "code": "1962",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "扎兰屯",
                    "code": "1963",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "牙克石",
                    "code": "1964",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阿荣旗",
                    "code": "1965",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "莫力达瓦达斡尔族自治旗",
                    "code": "1966",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "额尔古纳",
                    "code": "1967",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "根河",
                    "code": "1968",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "鄂伦春自治旗",
                    "code": "1969",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "鄂温克族自治旗",
                    "code": "1971",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "新巴尔虎右旗",
                    "code": "1972",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "新巴尔虎左旗",
                    "code": "1973",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "陈巴尔虎旗",
                    "code": "1974",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "兴安盟",
                    "code": "1980",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "乌兰浩特",
                    "code": "1981",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "科尔沁右翼前旗",
                    "code": "1982",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "科尔沁右翼中旗",
                    "code": "1983",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "扎赉特旗",
                    "code": "1984",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "突泉",
                    "code": "1985",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阿尔山",
                    "code": "1986",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "通辽",
                    "code": "1990",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "霍林郭勒",
                    "code": "1992",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "科尔沁左翼中旗",
                    "code": "1993",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "科尔沁左翼后旗",
                    "code": "1994",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "开鲁",
                    "code": "1995",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "库伦旗",
                    "code": "1996",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "奈曼旗",
                    "code": "1997",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "扎鲁特旗",
                    "code": "1998",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "锡林郭勒盟",
                    "code": "2010",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "二连浩特",
                    "code": "2011",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "锡林浩特",
                    "code": "2012",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阿巴嘎旗",
                    "code": "2013",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "苏尼特左旗",
                    "code": "2014",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "苏尼特右旗",
                    "code": "2015",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "东乌珠穆沁旗",
                    "code": "2016",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "西乌珠穆沁旗",
                    "code": "2017",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "太仆寺旗",
                    "code": "2018",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "镶黄旗",
                    "code": "2019",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "正镶白旗",
                    "code": "2021",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "正蓝旗",
                    "code": "2022",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "多伦",
                    "code": "2023",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "乌兰察布",
                    "code": "2030",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "卓资",
                    "code": "2035",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "化德",
                    "code": "2036",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "商都",
                    "code": "2037",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "兴和",
                    "code": "2038",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "丰镇",
                    "code": "2039",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "凉城",
                    "code": "2041",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "察哈尔右翼前旗",
                    "code": "2042",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "察哈尔右翼中旗",
                    "code": "2043",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "察哈尔右翼后旗",
                    "code": "2044",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "四子王旗",
                    "code": "2046",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "鄂尔多斯",
                    "code": "2050",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "东胜区",
                    "code": "2051",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "达拉特旗",
                    "code": "2052",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "准格尔旗",
                    "code": "2053",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "鄂托克前旗",
                    "code": "2054",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "鄂托克旗",
                    "code": "2055",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "杭锦旗",
                    "code": "2056",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "乌审旗",
                    "code": "2057",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "伊金霍洛旗",
                    "code": "2058",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "巴彦淖尔",
                    "code": "2070",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "五原",
                    "code": "2072",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "磴口",
                    "code": "2073",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "乌拉特前旗",
                    "code": "2074",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "乌拉特中旗",
                    "code": "2075",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "乌拉特后旗",
                    "code": "2076",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "杭锦后旗",
                    "code": "2077",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阿拉善盟",
                    "code": "2080",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阿拉善左旗",
                    "code": "2081",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阿拉善右旗",
                    "code": "2082",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "额济纳旗",
                    "code": "2083",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                }
            ]
        },
        {
            "name": "青海",
            "code": "8500",
            "sub": [
                {
                    "name": "西宁",
                    "code": "8510",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "天峻",
                    "code": "8595",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "湟中",
                    "code": "8512",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "湟源",
                    "code": "8513",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "海东地区",
                    "code": "8520",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "平安",
                    "code": "8521",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "民和回族土族自治",
                    "code": "8522",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "乐都",
                    "code": "8523",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "互助土族自治",
                    "code": "8526",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "化隆回族自治",
                    "code": "8527",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "循化撒拉族自治",
                    "code": "8528",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "海北藏族自治州",
                    "code": "8540",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "门源回族自治",
                    "code": "8541",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "祁连",
                    "code": "8542",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "海晏",
                    "code": "8543",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "刚察",
                    "code": "8544",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "黄南藏族自治州",
                    "code": "8550",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "同仁",
                    "code": "8551",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "尖扎",
                    "code": "8552",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "泽库",
                    "code": "8553",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "河南蒙古族自治",
                    "code": "8554",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "海南藏族自治州",
                    "code": "8560",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "共和",
                    "code": "8561",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "同德",
                    "code": "8562",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "贵德",
                    "code": "8563",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "兴海",
                    "code": "8564",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "贵南",
                    "code": "8565",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "果洛藏族自治州",
                    "code": "8570",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "玛沁",
                    "code": "8571",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "班玛",
                    "code": "8572",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "甘德",
                    "code": "8573",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "达日",
                    "code": "8574",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "久治",
                    "code": "8575",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "玛多",
                    "code": "8576",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "玉树藏族自治州",
                    "code": "8580",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "玉树",
                    "code": "8581",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "杂多",
                    "code": "8582",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "称多",
                    "code": "8583",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "治多",
                    "code": "8584",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "囊谦",
                    "code": "8585",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "曲麻莱",
                    "code": "8586",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "海西蒙古族藏族自治州",
                    "code": "8590",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "格尔木",
                    "code": "8591",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "德令哈",
                    "code": "8592",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "乌兰",
                    "code": "8593",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "都兰",
                    "code": "8594",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "大通回族土族自治",
                    "code": "8511",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                }
            ]
        },
        {
            "name": "江苏",
            "code": "3000",
            "sub": [
                {
                    "name": "南京",
                    "code": "3010",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "溧水",
                    "code": "3014",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "高淳",
                    "code": "3015",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "无锡",
                    "code": "3020",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "江阴",
                    "code": "3022",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宜兴",
                    "code": "3023",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "徐州",
                    "code": "3030",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "丰县",
                    "code": "3031",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "沛县",
                    "code": "3032",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "铜山",
                    "code": "3033",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "睢宁",
                    "code": "3034",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "邳州",
                    "code": "3035",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "新沂",
                    "code": "3036",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "常州",
                    "code": "3040",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "武进区",
                    "code": "3041",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "金坛",
                    "code": "3042",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "溧阳",
                    "code": "3043",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "苏州",
                    "code": "3050",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "太仓",
                    "code": "3051",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "昆山",
                    "code": "3052",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "吴江",
                    "code": "3054",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "常熟",
                    "code": "3055",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "张家港",
                    "code": "3056",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "南通",
                    "code": "3060",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "海安",
                    "code": "3061",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "如皋",
                    "code": "3062",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "如东",
                    "code": "3063",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "海门",
                    "code": "3065",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "启东",
                    "code": "3066",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "连云港",
                    "code": "3070",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "赣榆",
                    "code": "3071",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "东海",
                    "code": "3072",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "灌云",
                    "code": "3073",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "灌南",
                    "code": "3074",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "淮安",
                    "code": "3080",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "涟水",
                    "code": "3085",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "洪泽",
                    "code": "3087",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "盱眙",
                    "code": "3088",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "金湖",
                    "code": "3089",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "盐城",
                    "code": "3110",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "响水",
                    "code": "3111",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "滨海",
                    "code": "3112",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阜宁",
                    "code": "3113",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "射阳",
                    "code": "3114",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "建湖",
                    "code": "3115",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "大丰",
                    "code": "3116",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "东台",
                    "code": "3117",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "扬州",
                    "code": "3120",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "高邮",
                    "code": "3121",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宝应",
                    "code": "3122",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "江都",
                    "code": "3125",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "仪征",
                    "code": "3129",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "镇江",
                    "code": "3140",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "句容",
                    "code": "3142",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "扬中",
                    "code": "3143",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "丹阳",
                    "code": "3144",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "泰州",
                    "code": "3160",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "兴化",
                    "code": "3161",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "靖江",
                    "code": "3162",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "泰兴",
                    "code": "3163",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "姜堰",
                    "code": "3164",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宿迁",
                    "code": "3180",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "沭阳",
                    "code": "3181",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "泗阳",
                    "code": "3182",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "泗洪",
                    "code": "3183",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                }
            ]
        },
        {
            "name": "浙江",
            "code": "3300",
            "sub": [
                {
                    "name": "杭州",
                    "code": "3310",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "桐庐",
                    "code": "3311",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "富阳",
                    "code": "3312",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "临安",
                    "code": "3313",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "建德",
                    "code": "3315",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "淳安",
                    "code": "3316",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宁波",
                    "code": "3320",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "象山",
                    "code": "3321",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宁海",
                    "code": "3322",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "鄞州区",
                    "code": "3323",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "余姚",
                    "code": "3324",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "慈溪",
                    "code": "3325",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "奉化",
                    "code": "3326",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "温州",
                    "code": "3330",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "洞头",
                    "code": "3332",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "乐清",
                    "code": "3333",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "永嘉",
                    "code": "3334",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "平阳",
                    "code": "3335",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "苍南",
                    "code": "3336",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "文成",
                    "code": "3337",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "泰顺",
                    "code": "3338",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "瑞安",
                    "code": "3339",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "嘉兴",
                    "code": "3350",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "嘉善",
                    "code": "3351",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "平湖",
                    "code": "3352",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "海盐",
                    "code": "3353",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "桐乡",
                    "code": "3354",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "海宁",
                    "code": "3355",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "湖州",
                    "code": "3360",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "德清",
                    "code": "3361",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "长兴",
                    "code": "3362",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "安吉",
                    "code": "3363",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "绍兴",
                    "code": "3370",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "绍兴",
                    "code": "3371",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "上虞",
                    "code": "3372",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "嵊州",
                    "code": "3373",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "新昌",
                    "code": "3374",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "诸暨",
                    "code": "3375",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "金华",
                    "code": "3380",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "永康",
                    "code": "3382",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "武义",
                    "code": "3383",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "浦江",
                    "code": "3384",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "磐安",
                    "code": "3385",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "兰溪",
                    "code": "3386",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "义乌",
                    "code": "3387",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "东阳",
                    "code": "3388",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "衢州",
                    "code": "3410",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "常山",
                    "code": "3412",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "开化",
                    "code": "3413",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "龙游",
                    "code": "3414",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "江山",
                    "code": "3415",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "舟山",
                    "code": "3420",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "岱山",
                    "code": "3421",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "嵊泗",
                    "code": "3422",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "丽水",
                    "code": "3430",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "青田",
                    "code": "3432",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "云和",
                    "code": "3433",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "庆元",
                    "code": "3434",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "缙云",
                    "code": "3435",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "遂昌",
                    "code": "3436",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "松阳",
                    "code": "3437",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "景宁畲族自治",
                    "code": "3438",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "龙泉",
                    "code": "3439",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "台州",
                    "code": "3450",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "椒江区",
                    "code": "3451",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "临海",
                    "code": "3452",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "温岭",
                    "code": "3454",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "仙居",
                    "code": "3455",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "天台",
                    "code": "3456",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "三门",
                    "code": "3457",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "玉环",
                    "code": "3458",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                }
            ]
        },
        {
            "name": "安徽",
            "code": "3600",
            "sub": [
                {
                    "name": "合肥",
                    "code": "3610",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "长丰",
                    "code": "3611",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "肥东",
                    "code": "3612",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "肥西",
                    "code": "3613",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "芜湖",
                    "code": "3620",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "芜湖",
                    "code": "3621",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "繁昌",
                    "code": "3622",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "南陵",
                    "code": "3623",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "蚌埠",
                    "code": "3630",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "怀远",
                    "code": "3631",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "五河",
                    "code": "3632",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "固镇",
                    "code": "3633",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "淮南",
                    "code": "3640",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "凤台",
                    "code": "3641",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "马鞍山",
                    "code": "3650",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "当涂",
                    "code": "3651",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "淮北",
                    "code": "3660",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "濉溪",
                    "code": "3661",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "铜陵",
                    "code": "3670",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "铜陵",
                    "code": "3671",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "安庆",
                    "code": "3680",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "桐城",
                    "code": "3681",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "怀宁",
                    "code": "3682",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "枞阳",
                    "code": "3683",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "潜山",
                    "code": "3684",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "太湖",
                    "code": "3685",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宿松",
                    "code": "3686",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "望江",
                    "code": "3687",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "岳西",
                    "code": "3688",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "黄山",
                    "code": "3710",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "歙县",
                    "code": "3711",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "休宁",
                    "code": "3712",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "黟县",
                    "code": "3713",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "祁门",
                    "code": "3714",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阜阳",
                    "code": "3720",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "临泉",
                    "code": "3724",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "太和",
                    "code": "3725",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阜南",
                    "code": "3728",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "颍上",
                    "code": "3729",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "界首",
                    "code": "3731",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宿州",
                    "code": "3740",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "砀山",
                    "code": "3742",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "萧县",
                    "code": "3743",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "灵璧",
                    "code": "3745",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "泗县",
                    "code": "3746",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "滁州",
                    "code": "3750",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "天长",
                    "code": "3752",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "来安",
                    "code": "3753",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "全椒",
                    "code": "3754",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "定远",
                    "code": "3755",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "凤阳",
                    "code": "3756",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "明光",
                    "code": "3757",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "六安",
                    "code": "3760",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "寿县",
                    "code": "3763",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "霍邱",
                    "code": "3764",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "舒城",
                    "code": "3765",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "金寨",
                    "code": "3766",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "霍山",
                    "code": "3767",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宣城",
                    "code": "3770",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "郎溪",
                    "code": "3772",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "广德",
                    "code": "3773",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宁国",
                    "code": "3774",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "泾县",
                    "code": "3775",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "旌德",
                    "code": "3776",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "绩溪",
                    "code": "3777",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "巢湖",
                    "code": "3780",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "庐江",
                    "code": "3782",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "无为",
                    "code": "3783",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "含山",
                    "code": "3784",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "和县",
                    "code": "3785",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "池州",
                    "code": "3790",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "东至",
                    "code": "3792",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "石台",
                    "code": "3793",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "青阳",
                    "code": "3794",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "亳州",
                    "code": "3810",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "涡阳",
                    "code": "3811",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "蒙城",
                    "code": "3812",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "利辛",
                    "code": "3813",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                }
            ]
        },
        {
            "name": "福建",
            "code": "3900",
            "sub": [
                {
                    "name": "闽清",
                    "code": "3914",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "永泰",
                    "code": "3915",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "长乐",
                    "code": "3916",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "福清",
                    "code": "3917",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "平潭",
                    "code": "3918",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "厦门",
                    "code": "3930",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "莆田",
                    "code": "3940",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "仙游",
                    "code": "3942",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "三明",
                    "code": "3950",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "明溪",
                    "code": "3951",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "清流",
                    "code": "3952",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宁化",
                    "code": "3953",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "大田",
                    "code": "3954",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "尤溪",
                    "code": "3955",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "沙县",
                    "code": "3956",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "福州",
                    "code": "3910",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "闽侯",
                    "code": "3911",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "连江",
                    "code": "3912",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "罗源",
                    "code": "3913",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "将乐",
                    "code": "3957",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "泰宁",
                    "code": "3958",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "建宁",
                    "code": "3959",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "永安",
                    "code": "3961",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "泉州",
                    "code": "3970",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "惠安",
                    "code": "3971",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "晋江",
                    "code": "3972",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "南安",
                    "code": "3973",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "安溪",
                    "code": "3974",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "永春",
                    "code": "3975",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "德化",
                    "code": "3976",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "金门",
                    "code": "3977",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "石狮",
                    "code": "3978",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "漳州",
                    "code": "3990",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "龙海",
                    "code": "3991",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "云霄",
                    "code": "3992",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "漳浦",
                    "code": "3993",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "诏安",
                    "code": "3994",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "长泰",
                    "code": "3995",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "东山",
                    "code": "3996",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "南靖",
                    "code": "3997",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "平和",
                    "code": "3998",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "华安",
                    "code": "3999",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "南平",
                    "code": "4010",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "邵武",
                    "code": "4012",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "顺昌",
                    "code": "4013",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "建阳",
                    "code": "4014",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "建瓯",
                    "code": "4015",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "浦城",
                    "code": "4016",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "武夷山",
                    "code": "4017",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "光泽",
                    "code": "4018",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "松溪",
                    "code": "4019",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "政和",
                    "code": "4021",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宁德",
                    "code": "4030",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "福鼎",
                    "code": "4032",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "霞浦",
                    "code": "4033",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "福安",
                    "code": "4034",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "古田",
                    "code": "4035",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "屏南",
                    "code": "4036",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "寿宁",
                    "code": "4037",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "周宁",
                    "code": "4038",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "柘荣",
                    "code": "4039",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "龙岩",
                    "code": "4050",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "长汀",
                    "code": "4052",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "永定",
                    "code": "4053",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "上杭",
                    "code": "4054",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "武平",
                    "code": "4055",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "漳平",
                    "code": "4056",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "连城",
                    "code": "4057",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                }
            ]
        },
        {
            "name": "江西",
            "code": "4200",
            "sub": [
                {
                    "name": "南昌",
                    "code": "4210",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "南昌",
                    "code": "4211",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "新建",
                    "code": "4212",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "安义",
                    "code": "4213",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "进贤",
                    "code": "4214",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "景德镇",
                    "code": "4220",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "乐平",
                    "code": "4221",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "浮梁",
                    "code": "4222",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "萍乡",
                    "code": "4230",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "莲花",
                    "code": "4231",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "上栗",
                    "code": "4232",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "芦溪",
                    "code": "4233",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "九江",
                    "code": "4240",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "九江",
                    "code": "4241",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "瑞昌",
                    "code": "4242",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "武宁",
                    "code": "4243",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "修水",
                    "code": "4244",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "永修",
                    "code": "4245",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "德安",
                    "code": "4246",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "星子",
                    "code": "4247",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "都昌",
                    "code": "4248",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "湖口",
                    "code": "4249",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "彭泽",
                    "code": "4251",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "新余",
                    "code": "4260",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "分宜",
                    "code": "4261",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "鹰潭",
                    "code": "4270",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "贵溪",
                    "code": "4271",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "余江",
                    "code": "4272",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "赣州",
                    "code": "4280",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "赣县",
                    "code": "4282",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "南康",
                    "code": "4283",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "信丰",
                    "code": "4284",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "大余",
                    "code": "4285",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "上犹",
                    "code": "4286",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "崇义",
                    "code": "4287",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "安远",
                    "code": "4288",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "龙南",
                    "code": "4289",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "定南",
                    "code": "4291",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "全南",
                    "code": "4292",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宁都",
                    "code": "4293",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "于都",
                    "code": "4294",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "兴国",
                    "code": "4295",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "瑞金",
                    "code": "4296",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "会昌",
                    "code": "4297",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "寻乌",
                    "code": "4298",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "石城",
                    "code": "4299",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宜春",
                    "code": "4310",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "丰城",
                    "code": "4312",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "樟树",
                    "code": "4313",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "高安",
                    "code": "4314",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "奉新",
                    "code": "4315",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "万载",
                    "code": "4316",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "上高",
                    "code": "4317",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宜丰",
                    "code": "4318",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "靖安",
                    "code": "4319",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "铜鼓",
                    "code": "4321",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "上饶",
                    "code": "4330",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "上饶",
                    "code": "4332",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "广丰",
                    "code": "4333",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "玉山",
                    "code": "4334",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "铅山",
                    "code": "4335",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "横峰",
                    "code": "4336",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "弋阳",
                    "code": "4337",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "余干",
                    "code": "4338",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "鄱阳",
                    "code": "4339",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "万年",
                    "code": "4341",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "德兴",
                    "code": "4342",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "婺源",
                    "code": "4343",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "吉安",
                    "code": "4350",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "井冈山",
                    "code": "4352",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "吉安",
                    "code": "4353",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "吉水",
                    "code": "4354",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "峡江",
                    "code": "4355",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "新干",
                    "code": "4356",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "永丰",
                    "code": "4357",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "泰和",
                    "code": "4358",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "遂川",
                    "code": "4359",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "万安",
                    "code": "4361",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "安福",
                    "code": "4362",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "永新",
                    "code": "4363",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "抚州",
                    "code": "4370",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "南城",
                    "code": "4372",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "黎川",
                    "code": "4373",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "南丰",
                    "code": "4374",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "崇仁",
                    "code": "4375",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "乐安",
                    "code": "4376",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宜黄",
                    "code": "4377",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "金溪",
                    "code": "4378",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "资溪",
                    "code": "4379",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "东乡",
                    "code": "4381",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "广昌",
                    "code": "4382",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                }
            ]
        },
        {
            "name": "山东",
            "code": "4500",
            "sub": [
                {
                    "name": "济南",
                    "code": "4510",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "章丘",
                    "code": "4511",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "平阴",
                    "code": "4513",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "济阳",
                    "code": "4514",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "商河",
                    "code": "4515",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "青岛",
                    "code": "4520",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "即墨",
                    "code": "4521",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "胶南",
                    "code": "4522",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "莱西",
                    "code": "4523",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "平度",
                    "code": "4524",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "胶州",
                    "code": "4525",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "淄博",
                    "code": "4530",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "桓台",
                    "code": "4531",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "高青",
                    "code": "4532",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "沂源",
                    "code": "4533",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "枣庄",
                    "code": "4540",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "滕州",
                    "code": "4541",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "东营",
                    "code": "4550",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "垦利",
                    "code": "4551",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "利津",
                    "code": "4552",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "广饶",
                    "code": "4553",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "烟台",
                    "code": "4560",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "蓬莱",
                    "code": "4561",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "招远",
                    "code": "4562",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "栖霞",
                    "code": "4563",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "海阳",
                    "code": "4564",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "长岛",
                    "code": "4566",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "龙口",
                    "code": "4567",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "莱阳",
                    "code": "4568",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "莱州",
                    "code": "4569",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "潍坊",
                    "code": "4580",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "安丘",
                    "code": "4581",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "寿光",
                    "code": "4582",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "临朐",
                    "code": "4583",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "昌乐",
                    "code": "4584",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "昌邑",
                    "code": "4585",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "高密",
                    "code": "4586",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "青州",
                    "code": "4588",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "诸城",
                    "code": "4589",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "济宁",
                    "code": "4610",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "兖州",
                    "code": "4611",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "邹城",
                    "code": "4612",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "微山",
                    "code": "4613",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "鱼台",
                    "code": "4614",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "金乡",
                    "code": "4615",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "嘉祥",
                    "code": "4616",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "汶上",
                    "code": "4617",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "泗水",
                    "code": "4618",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "曲阜",
                    "code": "4619",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "梁山",
                    "code": "4621",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "泰安",
                    "code": "4630",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宁阳",
                    "code": "4631",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "肥城",
                    "code": "4632",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "东平",
                    "code": "4633",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "新泰",
                    "code": "4635",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "威海",
                    "code": "4650",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "乳山",
                    "code": "4651",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "文登",
                    "code": "4652",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "荣成",
                    "code": "4653",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "滨州",
                    "code": "4660",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "惠民",
                    "code": "4662",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阳信",
                    "code": "4663",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "无棣",
                    "code": "4664",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "沾化",
                    "code": "4665",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "博兴",
                    "code": "4666",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "邹平",
                    "code": "4667",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "德州",
                    "code": "4680",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "乐陵",
                    "code": "4682",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "陵县",
                    "code": "4683",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "平原",
                    "code": "4684",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "夏津",
                    "code": "4685",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "武城",
                    "code": "4686",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "临邑",
                    "code": "4689",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宁津",
                    "code": "4693",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "庆云",
                    "code": "4694",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "聊城",
                    "code": "4710",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "临清",
                    "code": "4712",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阳谷",
                    "code": "4713",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "莘县",
                    "code": "4714",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "茌平",
                    "code": "4715",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "东阿",
                    "code": "4716",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "冠县",
                    "code": "4717",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "高唐",
                    "code": "4718",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "临沂",
                    "code": "4730",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "郯城",
                    "code": "4733",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "苍山",
                    "code": "4734",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "莒南",
                    "code": "4735",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "沂水",
                    "code": "4737",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "蒙阴",
                    "code": "4739",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "平邑",
                    "code": "4741",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "费县",
                    "code": "4742",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "沂南",
                    "code": "4743",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "临沭",
                    "code": "4744",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "菏泽",
                    "code": "4750",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "曹县",
                    "code": "4752",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "定陶",
                    "code": "4753",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "成武",
                    "code": "4754",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "单县",
                    "code": "4755",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "巨野",
                    "code": "4756",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "郓城",
                    "code": "4758",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "鄄城",
                    "code": "4759",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "东明",
                    "code": "4761",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "日照",
                    "code": "4770",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "五莲",
                    "code": "4771",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "莒县",
                    "code": "4772",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "莱芜",
                    "code": "4790",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "齐河",
                    "code": "4687",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "禹城",
                    "code": "4688",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                }
            ]
        },
        {
            "name": "河南",
            "code": "4900",
            "sub": [
                {
                    "name": "郑州",
                    "code": "4910",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "荥阳",
                    "code": "4911",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "中牟",
                    "code": "4912",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "新郑",
                    "code": "4913",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "巩义",
                    "code": "4914",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "登封",
                    "code": "4915",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "新密",
                    "code": "4916",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "开封",
                    "code": "4920",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "杞县",
                    "code": "4921",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "通许",
                    "code": "4922",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "尉氏",
                    "code": "4923",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "开封",
                    "code": "4924",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "兰考",
                    "code": "4925",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "洛阳",
                    "code": "4930",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "偃师",
                    "code": "4931",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "孟津",
                    "code": "4932",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "新安",
                    "code": "4933",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "栾川",
                    "code": "4934",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "嵩县",
                    "code": "4935",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "汝阳",
                    "code": "4936",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宜阳",
                    "code": "4937",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "洛宁",
                    "code": "4938",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "伊川",
                    "code": "4939",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "平顶山",
                    "code": "4950",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宝丰",
                    "code": "4951",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "叶县",
                    "code": "4952",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "鲁山",
                    "code": "4953",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "郏县",
                    "code": "4954",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "汝州",
                    "code": "4956",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "舞钢",
                    "code": "4957",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "安阳",
                    "code": "4960",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "林州",
                    "code": "4961",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "安阳",
                    "code": "4962",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "汤阴",
                    "code": "4963",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "滑县",
                    "code": "4964",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "内黄",
                    "code": "4965",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "鹤壁",
                    "code": "4970",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "浚县",
                    "code": "4971",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "淇县",
                    "code": "4972",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "新乡",
                    "code": "4980",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "新乡",
                    "code": "4981",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "获嘉",
                    "code": "4982",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "原阳",
                    "code": "4983",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "延津",
                    "code": "4984",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "封丘",
                    "code": "4985",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "长垣",
                    "code": "4986",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "卫辉",
                    "code": "4987",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "辉县",
                    "code": "4988",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "焦作",
                    "code": "5010",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "修武",
                    "code": "5011",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "博爱",
                    "code": "5012",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "武陟",
                    "code": "5013",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "沁阳",
                    "code": "5014",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "温县",
                    "code": "5015",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "孟州",
                    "code": "5016",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "济源",
                    "code": "5017",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "濮阳",
                    "code": "5020",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "清丰",
                    "code": "5021",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "南乐",
                    "code": "5022",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "范县",
                    "code": "5023",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "台前",
                    "code": "5024",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "濮阳",
                    "code": "5025",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "许昌",
                    "code": "5030",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "长葛",
                    "code": "5031",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "许昌",
                    "code": "5032",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "鄢陵",
                    "code": "5033",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "禹州",
                    "code": "5034",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "襄城",
                    "code": "5035",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "漯河",
                    "code": "5040",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "舞阳",
                    "code": "5041",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "临颍",
                    "code": "5042",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "三门峡",
                    "code": "5050",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "渑池",
                    "code": "5051",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "陕县",
                    "code": "5052",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "灵宝",
                    "code": "5053",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "卢氏",
                    "code": "5054",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "义马",
                    "code": "5055",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "商丘",
                    "code": "5060",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "虞城",
                    "code": "5062",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "民权",
                    "code": "5064",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宁陵",
                    "code": "5065",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "睢县",
                    "code": "5066",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "夏邑",
                    "code": "5067",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "柘城",
                    "code": "5068",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "永城",
                    "code": "5069",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "周口",
                    "code": "5080",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "扶沟",
                    "code": "5082",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "西华",
                    "code": "5083",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "商水",
                    "code": "5084",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "太康",
                    "code": "5085",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "鹿邑",
                    "code": "5086",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "郸城",
                    "code": "5087",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "淮阳",
                    "code": "5088",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "沈丘",
                    "code": "5089",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "项城",
                    "code": "5091",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "驻马店",
                    "code": "5110",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "确山",
                    "code": "5112",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "泌阳",
                    "code": "5113",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "遂平",
                    "code": "5114",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "西平",
                    "code": "5115",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "上蔡",
                    "code": "5116",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "汝南",
                    "code": "5117",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "平舆",
                    "code": "5118",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "新蔡",
                    "code": "5119",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "正阳",
                    "code": "5121",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "南阳",
                    "code": "5130",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "邓州",
                    "code": "5132",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "南召",
                    "code": "5133",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "方城",
                    "code": "5134",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "西峡",
                    "code": "5135",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "镇平",
                    "code": "5137",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "内乡",
                    "code": "5138",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "淅川",
                    "code": "5139",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "社旗",
                    "code": "5141",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "唐河",
                    "code": "5142",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "新野",
                    "code": "5143",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "桐柏",
                    "code": "5144",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "信阳",
                    "code": "5150",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "息县",
                    "code": "5152",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "淮滨",
                    "code": "5153",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "潢川",
                    "code": "5155",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "光山",
                    "code": "5156",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "固始",
                    "code": "5157",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "商城",
                    "code": "5158",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "罗山",
                    "code": "5159",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "新县",
                    "code": "5161",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                }
            ]
        },
        {
            "name": "辽宁",
            "code": "2200",
            "sub": [
                {
                    "name": "沈阳",
                    "code": "2210",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "兴城",
                    "code": "2363",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "辽中",
                    "code": "2212",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "康平",
                    "code": "2213",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "法库",
                    "code": "2214",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "大连",
                    "code": "2220",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "普兰店",
                    "code": "2221",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "长海",
                    "code": "2222",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "庄河",
                    "code": "2223",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "瓦房店",
                    "code": "2224",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "鞍山",
                    "code": "2230",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "台安",
                    "code": "2231",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "海城",
                    "code": "2232",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "岫岩满族自治",
                    "code": "2233",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "抚顺",
                    "code": "2240",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "抚顺",
                    "code": "2241",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "新宾满族自治",
                    "code": "2242",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "清原满族自治",
                    "code": "2243",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "本溪",
                    "code": "2250",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "本溪满族自治",
                    "code": "2251",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "桓仁满族自治",
                    "code": "2252",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "丹东",
                    "code": "2260",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "凤城",
                    "code": "2261",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "东港",
                    "code": "2263",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宽甸满族自治",
                    "code": "2264",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "锦州",
                    "code": "2270",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "凌海",
                    "code": "2272",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "北镇",
                    "code": "2273",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "黑山",
                    "code": "2274",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "义县",
                    "code": "2275",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "营口",
                    "code": "2280",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "大石桥",
                    "code": "2281",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "盖州",
                    "code": "2282",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阜新",
                    "code": "2290",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阜新蒙古族自治",
                    "code": "2291",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "彰武",
                    "code": "2292",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "辽阳",
                    "code": "2310",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "辽阳",
                    "code": "2311",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "灯塔",
                    "code": "2312",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "盘锦",
                    "code": "2320",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "大洼",
                    "code": "2321",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "盘山",
                    "code": "2322",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "铁岭",
                    "code": "2330",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "铁岭",
                    "code": "2331",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "西丰",
                    "code": "2332",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "昌图",
                    "code": "2333",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "调兵山",
                    "code": "2336",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "开原",
                    "code": "2337",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "朝阳",
                    "code": "2340",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "朝阳",
                    "code": "2341",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "建平",
                    "code": "2342",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "凌源",
                    "code": "2343",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "喀喇沁左翼蒙古族自治",
                    "code": "2344",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "北票",
                    "code": "2346",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "葫芦岛",
                    "code": "2360",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "绥中",
                    "code": "2361",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "建昌",
                    "code": "2362",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "新民",
                    "code": "2211",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                }
            ]
        },
        {
            "name": "吉林",
            "code": "2400",
            "sub": [
                {
                    "name": "长春",
                    "code": "2410",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "乾安",
                    "code": "2514",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "农安",
                    "code": "2412",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "德惠",
                    "code": "2413",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "九台",
                    "code": "2415",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "吉林",
                    "code": "2420",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "永吉",
                    "code": "2421",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "舒兰",
                    "code": "2422",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "磐石",
                    "code": "2423",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "蛟河",
                    "code": "2424",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "桦甸",
                    "code": "2425",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "四平",
                    "code": "2430",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "梨树",
                    "code": "2431",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "伊通满族自治",
                    "code": "2432",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "双辽",
                    "code": "2433",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "公主岭",
                    "code": "2434",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "辽源",
                    "code": "2440",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "东丰",
                    "code": "2441",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "东辽",
                    "code": "2442",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "通化",
                    "code": "2450",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "通化",
                    "code": "2451",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "辉南",
                    "code": "2452",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "柳河",
                    "code": "2453",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "梅河口",
                    "code": "2454",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "集安",
                    "code": "2455",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "白山",
                    "code": "2460",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "抚松",
                    "code": "2461",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "靖宇",
                    "code": "2462",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "长白朝鲜族自治",
                    "code": "2463",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "临江",
                    "code": "2464",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "白城",
                    "code": "2470",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "洮南",
                    "code": "2472",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "大安",
                    "code": "2474",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "镇赉",
                    "code": "2477",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "通榆",
                    "code": "2478",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "延边朝鲜族自治州",
                    "code": "2490",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "延吉",
                    "code": "2491",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "图们",
                    "code": "2492",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "敦化",
                    "code": "2493",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "珲春",
                    "code": "2494",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "龙井",
                    "code": "2495",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "和龙",
                    "code": "2496",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "汪清",
                    "code": "2497",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "安图",
                    "code": "2498",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "松原",
                    "code": "2510",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "扶余",
                    "code": "2511",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "长岭",
                    "code": "2512",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "前郭尔罗斯蒙古族自治",
                    "code": "2513",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "榆树",
                    "code": "2411",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                }
            ]
        },
        {
            "name": "黑龙江",
            "code": "2600",
            "sub": [
                {
                    "name": "漠河",
                    "code": "2793",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "哈尔滨",
                    "code": "2610",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "依兰",
                    "code": "2613",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "双城",
                    "code": "2621",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "尚志",
                    "code": "2622",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宾县",
                    "code": "2623",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "五常",
                    "code": "2624",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "巴彦",
                    "code": "2625",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "木兰",
                    "code": "2626",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "通河",
                    "code": "2627",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "方正",
                    "code": "2628",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "延寿",
                    "code": "2629",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "齐齐哈尔",
                    "code": "2640",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "龙江",
                    "code": "2641",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "讷河",
                    "code": "2642",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "依安",
                    "code": "2643",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "泰来",
                    "code": "2644",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "甘南",
                    "code": "2645",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "富裕",
                    "code": "2647",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "克山",
                    "code": "2649",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "克东",
                    "code": "2651",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "拜泉",
                    "code": "2652",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "鸡西",
                    "code": "2660",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "鸡东",
                    "code": "2661",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "虎林",
                    "code": "2662",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "密山",
                    "code": "2663",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "鹤岗",
                    "code": "2670",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "萝北",
                    "code": "2671",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "绥滨",
                    "code": "2672",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "双鸭山",
                    "code": "2680",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "集贤",
                    "code": "2681",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宝清",
                    "code": "2682",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "饶河",
                    "code": "2683",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "友谊",
                    "code": "2684",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "大庆",
                    "code": "2690",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "林甸",
                    "code": "2691",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "杜尔伯特蒙古族自治",
                    "code": "2692",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "肇源",
                    "code": "2693",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "肇州",
                    "code": "2694",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "伊春",
                    "code": "2710",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "嘉荫",
                    "code": "2711",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "铁力",
                    "code": "2712",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "佳木斯",
                    "code": "2720",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "桦南",
                    "code": "2721",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "桦川",
                    "code": "2723",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "汤原",
                    "code": "2725",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "抚远",
                    "code": "2727",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "同江",
                    "code": "2729",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "富锦",
                    "code": "2731",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "七台河",
                    "code": "2740",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "勃利",
                    "code": "2741",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "牡丹江",
                    "code": "2750",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宁安",
                    "code": "2751",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "海林",
                    "code": "2752",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "穆棱",
                    "code": "2753",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "东宁",
                    "code": "2754",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "林口",
                    "code": "2755",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "绥芬河",
                    "code": "2757",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "绥化",
                    "code": "2760",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "安达",
                    "code": "2762",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "肇东",
                    "code": "2763",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "海伦",
                    "code": "2764",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "望奎",
                    "code": "2765",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "兰西",
                    "code": "2766",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "青冈",
                    "code": "2767",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "庆安",
                    "code": "2771",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "明水",
                    "code": "2772",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "绥棱",
                    "code": "2773",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "黑河",
                    "code": "2780",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "北安",
                    "code": "2782",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "五大连池",
                    "code": "2783",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "嫩江",
                    "code": "2784",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "逊克",
                    "code": "2786",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "孙吴",
                    "code": "2787",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "大兴安岭地区",
                    "code": "2790",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "呼玛",
                    "code": "2791",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "塔河",
                    "code": "2792",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                }
            ]
        },
        {
            "name": "湖北",
            "code": "5200",
            "sub": [
                {
                    "name": "武汉",
                    "code": "5210",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "黄石",
                    "code": "5220",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "大冶",
                    "code": "5221",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阳新",
                    "code": "5222",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "十堰",
                    "code": "5230",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "郧县",
                    "code": "5231",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "郧西",
                    "code": "5232",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "竹山",
                    "code": "5233",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "竹溪",
                    "code": "5234",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "房县",
                    "code": "5235",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "丹江口",
                    "code": "5236",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宜昌",
                    "code": "5250",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宜都",
                    "code": "5251",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "当阳",
                    "code": "5262",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "枝江",
                    "code": "5264",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "远安",
                    "code": "5265",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "兴山",
                    "code": "5266",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "秭归",
                    "code": "5267",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "长阳土家族自治",
                    "code": "5268",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "五峰土家族自治",
                    "code": "5269",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "随州",
                    "code": "5270",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "广水",
                    "code": "5271",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "随县",
                    "code": "5272",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "襄阳",
                    "code": "5280",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宜城",
                    "code": "5282",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "南漳",
                    "code": "5283",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "谷城",
                    "code": "5284",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "保康",
                    "code": "5285",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "老河口",
                    "code": "5287",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "枣阳",
                    "code": "5288",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "鄂州",
                    "code": "5310",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "神农架林区",
                    "code": "5311",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "荆门",
                    "code": "5320",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "京山",
                    "code": "5321",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "沙洋",
                    "code": "5322",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "钟祥",
                    "code": "5323",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "黄冈",
                    "code": "5330",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "麻城",
                    "code": "5331",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "武穴",
                    "code": "5332",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "团风",
                    "code": "5333",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "红安",
                    "code": "5334",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "罗田",
                    "code": "5335",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "英山",
                    "code": "5336",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "浠水",
                    "code": "5337",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "蕲春",
                    "code": "5338",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "黄梅",
                    "code": "5339",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "孝感",
                    "code": "5350",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "孝昌",
                    "code": "5351",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "应城",
                    "code": "5352",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "安陆",
                    "code": "5353",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "大悟",
                    "code": "5355",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "云梦",
                    "code": "5356",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "汉川",
                    "code": "5357",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "咸宁",
                    "code": "5360",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "嘉鱼",
                    "code": "5363",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "通城",
                    "code": "5364",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "崇阳",
                    "code": "5365",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "通山",
                    "code": "5366",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "赤壁",
                    "code": "5367",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "荆州",
                    "code": "5370",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "仙桃",
                    "code": "5371",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "石首",
                    "code": "5372",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "洪湖",
                    "code": "5373",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "天门",
                    "code": "5374",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "潜江",
                    "code": "5375",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "江陵",
                    "code": "5376",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "松滋",
                    "code": "5377",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "公安",
                    "code": "5378",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "监利",
                    "code": "5379",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "恩施土家族苗族自治州",
                    "code": "5410",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "恩施",
                    "code": "5411",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "利川",
                    "code": "5412",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "建始",
                    "code": "5413",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "巴东",
                    "code": "5414",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宣恩",
                    "code": "5415",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "咸丰",
                    "code": "5416",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "来凤",
                    "code": "5417",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "鹤峰",
                    "code": "5418",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                }
            ]
        },
        {
            "name": "湖南",
            "code": "5500",
            "sub": [
                {
                    "name": "长沙",
                    "code": "5510",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "望城",
                    "code": "5512",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "浏阳",
                    "code": "5513",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宁乡",
                    "code": "5514",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "株洲",
                    "code": "5520",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "株洲",
                    "code": "5521",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "攸县",
                    "code": "5522",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "茶陵",
                    "code": "5523",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "炎陵",
                    "code": "5524",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "醴陵",
                    "code": "5525",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "湘潭",
                    "code": "5530",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "湘乡",
                    "code": "5532",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "韶山",
                    "code": "5533",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "衡阳",
                    "code": "5540",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "衡阳",
                    "code": "5541",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "衡南",
                    "code": "5542",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "衡山",
                    "code": "5543",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "衡东",
                    "code": "5544",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "常宁",
                    "code": "5545",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "祁东",
                    "code": "5546",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "耒阳",
                    "code": "5547",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "邵阳",
                    "code": "5550",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "邵东",
                    "code": "5551",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "新邵",
                    "code": "5552",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "邵阳",
                    "code": "5553",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "隆回",
                    "code": "5554",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "洞口",
                    "code": "5555",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "武冈",
                    "code": "5556",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "绥宁",
                    "code": "5557",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "新宁",
                    "code": "5558",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "城步苗族自治",
                    "code": "5559",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "岳阳",
                    "code": "5570",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "岳阳",
                    "code": "5571",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "临湘",
                    "code": "5572",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "华容",
                    "code": "5573",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "湘阴",
                    "code": "5574",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "平江",
                    "code": "5575",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "汨罗",
                    "code": "5576",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "常德",
                    "code": "5580",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "安乡",
                    "code": "5581",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "汉寿",
                    "code": "5582",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "澧县",
                    "code": "5583",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "临澧",
                    "code": "5584",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "桃源",
                    "code": "5585",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "石门",
                    "code": "5586",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "津",
                    "code": "5587",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "张家界",
                    "code": "5590",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "慈利",
                    "code": "5591",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "桑植",
                    "code": "5592",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "益阳",
                    "code": "5610",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "沅江",
                    "code": "5612",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "南县",
                    "code": "5614",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "桃江",
                    "code": "5615",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "安化",
                    "code": "5616",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "娄底",
                    "code": "5620",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "冷水江",
                    "code": "5622",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "涟源",
                    "code": "5623",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "双峰",
                    "code": "5624",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "新化",
                    "code": "5625",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "郴州",
                    "code": "5630",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "资兴",
                    "code": "5632",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "桂阳",
                    "code": "5634",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "永兴",
                    "code": "5635",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宜章",
                    "code": "5636",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "嘉禾",
                    "code": "5637",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "临武",
                    "code": "5638",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "汝城",
                    "code": "5639",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "桂东",
                    "code": "5641",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "安仁",
                    "code": "5642",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "永州",
                    "code": "5650",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "东安",
                    "code": "5653",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "道县",
                    "code": "5654",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宁远",
                    "code": "5655",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "江永",
                    "code": "5656",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "江华瑶族自治",
                    "code": "5657",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "蓝山",
                    "code": "5658",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "新田",
                    "code": "5659",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "双牌",
                    "code": "5661",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "祁阳",
                    "code": "5662",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "怀化",
                    "code": "5670",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "洪江",
                    "code": "5672",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "沅陵",
                    "code": "5674",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "辰溪",
                    "code": "5675",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "溆浦",
                    "code": "5676",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "麻阳苗族自治",
                    "code": "5677",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "新晃侗族自治",
                    "code": "5678",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "芷江侗族自治",
                    "code": "5679",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "会同",
                    "code": "5681",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "靖州苗族侗族自治",
                    "code": "5682",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "通道侗族自治",
                    "code": "5683",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "中方",
                    "code": "5684",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "湘西土家族苗族自治州",
                    "code": "5690",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "吉首",
                    "code": "5691",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "泸溪",
                    "code": "5692",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "凤凰",
                    "code": "5693",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "花垣",
                    "code": "5694",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "保靖",
                    "code": "5695",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "古丈",
                    "code": "5696",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "永顺",
                    "code": "5697",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "龙山",
                    "code": "5698",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                }
            ]
        },
        {
            "name": "广东",
            "code": "5800",
            "sub": [
                {
                    "name": "广州",
                    "code": "5810",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "从化",
                    "code": "5812",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "增城",
                    "code": "5813",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "韶关",
                    "code": "5820",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "始兴",
                    "code": "5822",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "南雄",
                    "code": "5823",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "仁化",
                    "code": "5824",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "乐昌",
                    "code": "5825",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "翁源",
                    "code": "5826",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "乳源瑶族自治",
                    "code": "5827",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "新丰",
                    "code": "5828",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "深圳",
                    "code": "5840",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "珠海",
                    "code": "5850",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "汕头",
                    "code": "5860",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "南澳",
                    "code": "5863",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "佛山",
                    "code": "5880",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "三水区",
                    "code": "5881",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "南海区",
                    "code": "5882",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "顺德区",
                    "code": "5883",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "江门",
                    "code": "5890",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "台山",
                    "code": "5892",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "恩平",
                    "code": "5893",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "开平",
                    "code": "5894",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "鹤山",
                    "code": "5895",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "湛江",
                    "code": "5910",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "吴川",
                    "code": "5911",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "廉江",
                    "code": "5912",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "遂溪",
                    "code": "5913",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "雷州",
                    "code": "5914",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "徐闻",
                    "code": "5915",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "茂名",
                    "code": "5920",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "信宜",
                    "code": "5921",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "高州",
                    "code": "5922",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "电白",
                    "code": "5923",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "化州",
                    "code": "5924",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "肇庆",
                    "code": "5930",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "高要",
                    "code": "5931",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "四会",
                    "code": "5932",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "广宁",
                    "code": "5933",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "怀集",
                    "code": "5934",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "封开",
                    "code": "5935",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "德庆",
                    "code": "5936",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "惠州",
                    "code": "5950",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "博罗",
                    "code": "5952",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "惠东",
                    "code": "5953",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "龙门",
                    "code": "5954",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "梅州",
                    "code": "5960",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "梅县",
                    "code": "5961",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "大埔",
                    "code": "5962",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "丰顺",
                    "code": "5963",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "五华",
                    "code": "5964",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "兴宁",
                    "code": "5965",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "平远",
                    "code": "5966",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "蕉岭",
                    "code": "5967",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "汕尾",
                    "code": "5970",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "海丰",
                    "code": "5971",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "陆丰",
                    "code": "5972",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "陆河",
                    "code": "5973",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "河源",
                    "code": "5980",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "紫金",
                    "code": "5981",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "龙川",
                    "code": "5982",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "连平",
                    "code": "5983",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "和平",
                    "code": "5984",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "东源",
                    "code": "5985",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阳江",
                    "code": "5990",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阳西",
                    "code": "5991",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阳春",
                    "code": "5992",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阳东",
                    "code": "5993",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "清远",
                    "code": "6010",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "佛冈",
                    "code": "6011",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "英德",
                    "code": "6012",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阳山",
                    "code": "6013",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "连州",
                    "code": "6014",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "连山壮族瑶族自治",
                    "code": "6015",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "连南瑶族自治",
                    "code": "6016",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "清新",
                    "code": "6017",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "东莞",
                    "code": "6020",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "中山",
                    "code": "6030",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "潮州",
                    "code": "6040",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "潮安",
                    "code": "6041",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "饶平",
                    "code": "6042",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "揭阳",
                    "code": "6050",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "揭东",
                    "code": "6051",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "揭西",
                    "code": "6052",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "惠来",
                    "code": "6053",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "普宁",
                    "code": "6054",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "云浮",
                    "code": "6060",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "新兴",
                    "code": "6061",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "郁南",
                    "code": "6062",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "云安",
                    "code": "6063",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "罗定",
                    "code": "6064",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                }
            ]
        },
        {
            "name": "海南",
            "code": "6400",
            "sub": [
                {
                    "name": "海口",
                    "code": "6410",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "中沙群岛的岛礁及其海域",
                    "code": "6442",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "五指山",
                    "code": "6421",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "文昌",
                    "code": "6423",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "琼海",
                    "code": "6424",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "万宁",
                    "code": "6425",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "定安",
                    "code": "6426",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "屯昌",
                    "code": "6427",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "澄迈",
                    "code": "6428",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "临高",
                    "code": "6429",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "儋州",
                    "code": "6431",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "白沙黎族自治",
                    "code": "6432",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "昌江黎族自治",
                    "code": "6433",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "东方",
                    "code": "6434",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "乐东黎族自治",
                    "code": "6435",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "陵水黎族自治",
                    "code": "6436",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "保亭黎族苗族自治",
                    "code": "6437",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "琼中黎族苗族自治",
                    "code": "6438",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "西沙群岛",
                    "code": "6439",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "南沙群岛",
                    "code": "6441",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "三亚",
                    "code": "6420",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                }
            ]
        },
        {
            "name": "四川",
            "code": "6500",
            "sub": [
                {
                    "name": "成都",
                    "code": "6510",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "金堂",
                    "code": "6511",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "双流",
                    "code": "6512",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "郫县",
                    "code": "6514",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "彭州",
                    "code": "6516",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "崇州",
                    "code": "6517",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "大邑",
                    "code": "6518",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "邛崃",
                    "code": "6519",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "蒲江",
                    "code": "6521",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "新津",
                    "code": "6522",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "都江堰",
                    "code": "6523",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "自贡",
                    "code": "6550",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "荣县",
                    "code": "6551",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "富顺",
                    "code": "6552",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "攀枝花",
                    "code": "6560",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "米易",
                    "code": "6561",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "盐边",
                    "code": "6562",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "泸州",
                    "code": "6570",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "泸县",
                    "code": "6571",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "合江",
                    "code": "6572",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "叙永",
                    "code": "6574",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "古蔺",
                    "code": "6575",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "德阳",
                    "code": "6580",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "绵竹",
                    "code": "6581",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "中江",
                    "code": "6582",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "什邡",
                    "code": "6583",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "广汉",
                    "code": "6584",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "罗江",
                    "code": "6585",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "绵阳",
                    "code": "6590",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "三台",
                    "code": "6591",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "盐亭",
                    "code": "6592",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "安县",
                    "code": "6593",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "梓潼",
                    "code": "6594",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "北川羌族自治",
                    "code": "6595",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "平武",
                    "code": "6596",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "江油",
                    "code": "6597",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "广元",
                    "code": "6610",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "旺苍",
                    "code": "6611",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "青川",
                    "code": "6612",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "剑阁",
                    "code": "6613",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "苍溪",
                    "code": "6614",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "遂宁",
                    "code": "6620",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "蓬溪",
                    "code": "6621",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "射洪",
                    "code": "6622",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "大英",
                    "code": "6623",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "内江",
                    "code": "6630",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "威远",
                    "code": "6634",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "资中",
                    "code": "6635",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "隆昌",
                    "code": "6638",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "乐山",
                    "code": "6650",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "犍为",
                    "code": "6653",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "井研",
                    "code": "6654",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "夹江",
                    "code": "6655",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "沐川",
                    "code": "6658",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "峨边彝族自治",
                    "code": "6662",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "马边彝族自治",
                    "code": "6663",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "峨眉山",
                    "code": "6664",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宜宾",
                    "code": "6710",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宜宾",
                    "code": "6712",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "南溪",
                    "code": "6713",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "江安",
                    "code": "6714",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "长宁",
                    "code": "6715",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "高县",
                    "code": "6716",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "筠连",
                    "code": "6717",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "珙县",
                    "code": "6718",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "兴文",
                    "code": "6719",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "屏山",
                    "code": "6721",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "南充",
                    "code": "6730",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "南部",
                    "code": "6734",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "营山",
                    "code": "6736",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "蓬安",
                    "code": "6738",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "仪陇",
                    "code": "6739",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "西充",
                    "code": "6742",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阆中",
                    "code": "6743",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "达州",
                    "code": "6750",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "达县",
                    "code": "6752",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宣汉",
                    "code": "6753",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "开江",
                    "code": "6754",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "万源",
                    "code": "6755",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "大竹",
                    "code": "6761",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "渠县",
                    "code": "6762",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "雅安",
                    "code": "6770",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "名山",
                    "code": "6772",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "荥经",
                    "code": "6773",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "汉源",
                    "code": "6774",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "石棉",
                    "code": "6775",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "天全",
                    "code": "6776",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "芦山",
                    "code": "6777",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宝兴",
                    "code": "6778",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阿坝藏族羌族自治州",
                    "code": "6790",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "汶川",
                    "code": "6791",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "理县",
                    "code": "6792",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "茂县",
                    "code": "6793",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "松潘",
                    "code": "6794",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "九寨沟",
                    "code": "6795",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "金川",
                    "code": "6796",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "小金",
                    "code": "6797",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "黑水",
                    "code": "6798",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "马尔康",
                    "code": "6799",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "壤塘",
                    "code": "6801",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阿坝",
                    "code": "6802",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "若尔盖",
                    "code": "6803",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "红原",
                    "code": "6804",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "甘孜藏族自治州",
                    "code": "6810",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "康定",
                    "code": "6811",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "泸定",
                    "code": "6812",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "丹巴",
                    "code": "6813",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "九龙",
                    "code": "6814",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "雅江",
                    "code": "6815",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "道孚",
                    "code": "6816",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "炉霍",
                    "code": "6817",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "甘孜",
                    "code": "6818",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "新龙",
                    "code": "6819",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "德格",
                    "code": "6821",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "白玉",
                    "code": "6822",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "石渠",
                    "code": "6823",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "色达",
                    "code": "6824",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "理塘",
                    "code": "6825",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "巴塘",
                    "code": "6826",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "乡城",
                    "code": "6827",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "稻城",
                    "code": "6828",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "得荣",
                    "code": "6829",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "凉山彝族自治州",
                    "code": "6840",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "西昌",
                    "code": "6841",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "木里藏族自治",
                    "code": "6842",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "盐源",
                    "code": "6843",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "德昌",
                    "code": "6844",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "会理",
                    "code": "6845",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "会东",
                    "code": "6846",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宁南",
                    "code": "6847",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "普格",
                    "code": "6848",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "布拖",
                    "code": "6849",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "金阳",
                    "code": "6851",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "昭觉",
                    "code": "6852",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "喜德",
                    "code": "6853",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "冕宁",
                    "code": "6854",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "越西",
                    "code": "6855",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "甘洛",
                    "code": "6856",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "美姑",
                    "code": "6857",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "雷波",
                    "code": "6858",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "眉山",
                    "code": "6670",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "仁寿",
                    "code": "6671",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "彭山",
                    "code": "6672",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "洪雅",
                    "code": "6673",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "丹棱",
                    "code": "6674",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "青神",
                    "code": "6675",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "广安",
                    "code": "6690",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "岳池",
                    "code": "6691",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "武胜",
                    "code": "6692",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "邻水",
                    "code": "6693",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "华蓥",
                    "code": "6694",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "巴中",
                    "code": "6870",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "通江",
                    "code": "6871",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "南江",
                    "code": "6872",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "平昌",
                    "code": "6873",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "资阳",
                    "code": "6880",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "安岳",
                    "code": "6881",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "乐至",
                    "code": "6882",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "简阳",
                    "code": "6883",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                }
            ]
        },
        {
            "name": "贵州",
            "code": "7000",
            "sub": [
                {
                    "name": "贵阳",
                    "code": "7010",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "开阳",
                    "code": "7011",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "息烽",
                    "code": "7012",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "修文",
                    "code": "7013",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "清镇",
                    "code": "7014",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "六盘水",
                    "code": "7020",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "水城",
                    "code": "7021",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "盘县",
                    "code": "7022",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "遵义",
                    "code": "7030",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "遵义",
                    "code": "7032",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "桐梓",
                    "code": "7033",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "绥阳",
                    "code": "7034",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "正安",
                    "code": "7035",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "道真仡佬族苗族自治",
                    "code": "7036",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "务川仡佬族苗族自治",
                    "code": "7037",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "凤冈",
                    "code": "7038",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "湄潭",
                    "code": "7039",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "余庆",
                    "code": "7041",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "仁怀",
                    "code": "7042",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "赤水",
                    "code": "7043",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "习水",
                    "code": "7044",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "铜仁",
                    "code": "7050",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "铜仁",
                    "code": "7051",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "江口",
                    "code": "7052",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "玉屏侗族自治",
                    "code": "7053",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "石阡",
                    "code": "7054",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "思南",
                    "code": "7055",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "印江土家族苗族自治",
                    "code": "7056",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "德江",
                    "code": "7057",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "沿河土家族自治",
                    "code": "7058",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "松桃苗族自治",
                    "code": "7059",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "万山特区",
                    "code": "7061",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "黔西南布依族苗族自治州",
                    "code": "7070",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "兴义",
                    "code": "7071",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "兴仁",
                    "code": "7072",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "普安",
                    "code": "7073",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "晴隆",
                    "code": "7074",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "贞丰",
                    "code": "7075",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "望谟",
                    "code": "7076",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "册亨",
                    "code": "7077",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "安龙",
                    "code": "7078",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "毕节地区",
                    "code": "7090",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "毕节",
                    "code": "7091",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "大方",
                    "code": "7092",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "黔西",
                    "code": "7093",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "金沙",
                    "code": "7094",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "织金",
                    "code": "7095",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "纳雍",
                    "code": "7096",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "威宁彝族回族苗族自治",
                    "code": "7097",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "赫章",
                    "code": "7098",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "安顺",
                    "code": "7110",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "平坝",
                    "code": "7117",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "普定",
                    "code": "7118",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "关岭布依族苗族自治",
                    "code": "7119",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "镇宁布依族苗族自治",
                    "code": "7121",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "紫云苗族布依族自治",
                    "code": "7122",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "黔东南苗族侗族自治州",
                    "code": "7130",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "凯里",
                    "code": "7131",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "黄平",
                    "code": "7132",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "施秉",
                    "code": "7133",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "三穗",
                    "code": "7134",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "镇远",
                    "code": "7135",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "岑巩",
                    "code": "7136",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "天柱",
                    "code": "7137",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "锦屏",
                    "code": "7138",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "剑河",
                    "code": "7139",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "台江",
                    "code": "7141",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "黎平",
                    "code": "7142",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "榕江",
                    "code": "7143",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "从江",
                    "code": "7144",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "雷山",
                    "code": "7145",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "麻江",
                    "code": "7146",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "丹寨",
                    "code": "7147",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "黔南布依族苗族自治州",
                    "code": "7150",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "都匀",
                    "code": "7151",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "荔波",
                    "code": "7152",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "贵定",
                    "code": "7153",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "福泉",
                    "code": "7154",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "瓮安",
                    "code": "7155",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "独山",
                    "code": "7156",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "平塘",
                    "code": "7157",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "罗甸",
                    "code": "7158",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "长顺",
                    "code": "7159",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "龙里",
                    "code": "7161",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "惠水",
                    "code": "7162",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "三都水族自治",
                    "code": "7163",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                }
            ]
        },
        {
            "name": "云南",
            "code": "7300",
            "sub": [
                {
                    "name": "昆明",
                    "code": "7310",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "呈贡",
                    "code": "7311",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "晋宁",
                    "code": "7312",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "安宁",
                    "code": "7313",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "富民",
                    "code": "7314",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宜良",
                    "code": "7315",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "石林彝族自治",
                    "code": "7316",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "嵩明",
                    "code": "7317",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "禄劝彝族苗族自治",
                    "code": "7318",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "寻甸回族彝族自治",
                    "code": "7319",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "昭通",
                    "code": "7340",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "鲁甸",
                    "code": "7342",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "巧家",
                    "code": "7343",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "盐津",
                    "code": "7344",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "大关",
                    "code": "7345",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "永善",
                    "code": "7346",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "绥江",
                    "code": "7347",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "镇雄",
                    "code": "7348",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "彝良",
                    "code": "7349",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "威信",
                    "code": "7351",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "水富",
                    "code": "7352",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "曲靖",
                    "code": "7360",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "马龙",
                    "code": "7362",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宣威",
                    "code": "7363",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "富源",
                    "code": "7364",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "罗平",
                    "code": "7365",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "师宗",
                    "code": "7366",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "陆良",
                    "code": "7367",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "会泽",
                    "code": "7369",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "沾益",
                    "code": "7371",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "楚雄彝族自治州",
                    "code": "7380",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "楚雄",
                    "code": "7381",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "双柏",
                    "code": "7382",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "牟定",
                    "code": "7383",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "南华",
                    "code": "7384",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "姚安",
                    "code": "7385",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "大姚",
                    "code": "7386",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "永仁",
                    "code": "7387",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "元谋",
                    "code": "7388",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "武定",
                    "code": "7389",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "禄丰",
                    "code": "7391",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "玉溪",
                    "code": "7410",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "江川",
                    "code": "7412",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "澄江",
                    "code": "7413",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "通海",
                    "code": "7414",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "华宁",
                    "code": "7415",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "易门",
                    "code": "7416",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "峨山彝族自治",
                    "code": "7417",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "新平彝族傣族自治",
                    "code": "7418",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "元江哈尼族彝族傣族自治",
                    "code": "7419",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "红河哈尼族彝族自治州",
                    "code": "7430",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "个旧",
                    "code": "7431",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "开远",
                    "code": "7432",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "蒙自",
                    "code": "7433",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "屏边苗族自治",
                    "code": "7434",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "建水",
                    "code": "7435",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "石屏",
                    "code": "7436",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "弥勒",
                    "code": "7437",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "泸西",
                    "code": "7438",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "元阳",
                    "code": "7439",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "红河",
                    "code": "7441",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "金平苗族瑶族傣族自治",
                    "code": "7442",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "绿春",
                    "code": "7443",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "河口瑶族自治",
                    "code": "7444",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "文山壮族苗族自治州",
                    "code": "7450",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "文山",
                    "code": "7451",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "砚山",
                    "code": "7452",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "西畴",
                    "code": "7453",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "麻栗坡",
                    "code": "7454",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "马关",
                    "code": "7455",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "丘北",
                    "code": "7456",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "广南",
                    "code": "7457",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "富宁",
                    "code": "7458",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "普洱",
                    "code": "7470",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宁洱哈尼族彝族自治",
                    "code": "7472",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "墨江哈尼族自治",
                    "code": "7473",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "景东彝族自治",
                    "code": "7474",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "景谷傣族彝族自治",
                    "code": "7475",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "镇沅彝族哈尼族拉祜族自治",
                    "code": "7476",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "江城哈尼族彝族自治",
                    "code": "7477",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "孟连傣族拉祜族佤族自治",
                    "code": "7478",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "澜沧拉祜族自治",
                    "code": "7479",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "西盟佤族自治",
                    "code": "7481",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "西双版纳傣族自治州",
                    "code": "7490",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "景洪",
                    "code": "7491",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "勐海",
                    "code": "7492",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "勐腊",
                    "code": "7493",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "大理白族自治州",
                    "code": "7510",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "大理",
                    "code": "7511",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "漾濞彝族自治",
                    "code": "7512",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "祥云",
                    "code": "7513",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宾川",
                    "code": "7514",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "弥渡",
                    "code": "7515",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "南涧彝族自治",
                    "code": "7516",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "巍山彝族回族自治",
                    "code": "7517",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "永平",
                    "code": "7518",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "云龙",
                    "code": "7519",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "洱源",
                    "code": "7521",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "剑川",
                    "code": "7522",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "鹤庆",
                    "code": "7523",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "保山",
                    "code": "7530",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "施甸",
                    "code": "7532",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "腾冲",
                    "code": "7533",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "龙陵",
                    "code": "7534",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "昌宁",
                    "code": "7535",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "德宏傣族景颇族自治州",
                    "code": "7540",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "芒市",
                    "code": "7542",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "梁河",
                    "code": "7543",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "盈江",
                    "code": "7544",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "陇川",
                    "code": "7545",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "瑞丽",
                    "code": "7546",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "丽江",
                    "code": "7550",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "永胜",
                    "code": "7552",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "华坪",
                    "code": "7553",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宁蒗彝族自治",
                    "code": "7554",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "玉龙纳西族自治",
                    "code": "7555",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "怒江傈僳族自治州",
                    "code": "7560",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "泸水",
                    "code": "7561",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "福贡",
                    "code": "7562",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "贡山独龙族怒族自治",
                    "code": "7563",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "兰坪白族普米族自治",
                    "code": "7564",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "迪庆藏族自治州",
                    "code": "7570",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "香格里拉",
                    "code": "7571",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "德钦",
                    "code": "7572",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "维西傈僳族自治",
                    "code": "7573",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "临沧",
                    "code": "7580",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "凤庆",
                    "code": "7582",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "云县",
                    "code": "7583",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "永德",
                    "code": "7584",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "镇康",
                    "code": "7585",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "双江拉祜族佤族布朗族傣族自治",
                    "code": "7586",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "耿马傣族佤族自治",
                    "code": "7587",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "沧源佤族自治",
                    "code": "7588",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                }
            ]
        },
        {
            "name": "西藏自治区",
            "code": "7700",
            "sub": [
                {
                    "name": "拉萨",
                    "code": "7710",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "林周",
                    "code": "7711",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "当雄",
                    "code": "7712",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "尼木",
                    "code": "7713",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "曲水",
                    "code": "7714",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "堆龙德庆",
                    "code": "7715",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "达孜",
                    "code": "7716",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "墨竹工卡",
                    "code": "7717",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "昌都地区",
                    "code": "7720",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "昌都",
                    "code": "7721",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "江达",
                    "code": "7722",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "贡觉",
                    "code": "7723",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "类乌齐",
                    "code": "7724",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "丁青",
                    "code": "7725",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "察雅",
                    "code": "7726",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "八宿",
                    "code": "7727",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "左贡",
                    "code": "7728",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "芒康",
                    "code": "7729",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "洛隆",
                    "code": "7731",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "边坝",
                    "code": "7732",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "山南地区",
                    "code": "7740",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "乃东",
                    "code": "7741",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "扎囊",
                    "code": "7742",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "贡嘎",
                    "code": "7743",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "桑日",
                    "code": "7744",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "琼结",
                    "code": "7745",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "曲松",
                    "code": "7746",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "措美",
                    "code": "7747",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "洛扎",
                    "code": "7748",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "加查",
                    "code": "7749",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "隆子",
                    "code": "7751",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "错那",
                    "code": "7752",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "浪卡子",
                    "code": "7753",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "日喀则地区",
                    "code": "7760",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "日喀则",
                    "code": "7761",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "南木林",
                    "code": "7762",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "江孜",
                    "code": "7763",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "定日",
                    "code": "7764",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "萨迦",
                    "code": "7765",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "拉孜",
                    "code": "7766",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "昂仁",
                    "code": "7767",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "谢通门",
                    "code": "7768",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "白朗",
                    "code": "7769",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "仁布",
                    "code": "7771",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "康马",
                    "code": "7772",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "定结",
                    "code": "7773",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "仲巴",
                    "code": "7774",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "亚东",
                    "code": "7775",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "吉隆",
                    "code": "7776",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "聂拉木",
                    "code": "7777",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "萨嘎",
                    "code": "7778",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "岗巴",
                    "code": "7779",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "那曲地区",
                    "code": "7790",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "那曲",
                    "code": "7791",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "嘉黎",
                    "code": "7792",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "比如",
                    "code": "7793",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "聂荣",
                    "code": "7794",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "安多",
                    "code": "7795",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "申扎",
                    "code": "7796",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "索县",
                    "code": "7797",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "班戈",
                    "code": "7798",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "巴青",
                    "code": "7799",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "尼玛以及双湖特别区",
                    "code": "7801",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阿里地区",
                    "code": "7810",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "普兰",
                    "code": "7811",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "札达",
                    "code": "7812",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "噶尔",
                    "code": "7813",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "日土",
                    "code": "7814",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "革吉",
                    "code": "7815",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "改则",
                    "code": "7816",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "措勤",
                    "code": "7817",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "林芝地区",
                    "code": "7830",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "林芝",
                    "code": "7831",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "工布江达",
                    "code": "7832",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "米林",
                    "code": "7833",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "墨脱",
                    "code": "7834",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "波密",
                    "code": "7835",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "察隅",
                    "code": "7836",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "朗县",
                    "code": "7837",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                }
            ]
        },
        {
            "name": "陕西",
            "code": "7900",
            "sub": [
                {
                    "name": "西安",
                    "code": "7910",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "蓝田",
                    "code": "7912",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "周至",
                    "code": "7914",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "户县",
                    "code": "7915",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "高陵",
                    "code": "7916",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "铜川",
                    "code": "7920",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宜君",
                    "code": "7922",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宝鸡",
                    "code": "7930",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "凤翔",
                    "code": "7932",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "岐山",
                    "code": "7933",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "扶风",
                    "code": "7934",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "眉县",
                    "code": "7935",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "陇县",
                    "code": "7936",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "千阳",
                    "code": "7937",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "麟游",
                    "code": "7938",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "凤县",
                    "code": "7939",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "太白",
                    "code": "7941",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "咸阳",
                    "code": "7950",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "兴平",
                    "code": "7951",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "三原",
                    "code": "7952",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "泾阳",
                    "code": "7953",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "乾县",
                    "code": "7954",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "礼泉",
                    "code": "7955",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "永寿",
                    "code": "7956",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "彬县",
                    "code": "7957",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "长武",
                    "code": "7958",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "旬邑",
                    "code": "7959",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "淳化",
                    "code": "7961",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "武功",
                    "code": "7962",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "渭南",
                    "code": "7970",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "韩城",
                    "code": "7972",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "华县",
                    "code": "7973",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "华阴",
                    "code": "7974",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "潼关",
                    "code": "7975",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "大荔",
                    "code": "7976",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "蒲城",
                    "code": "7977",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "澄城",
                    "code": "7978",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "白水",
                    "code": "7979",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "合阳",
                    "code": "7981",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "富平",
                    "code": "7982",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "汉中",
                    "code": "7990",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "南郑",
                    "code": "7992",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "城固",
                    "code": "7993",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "洋县",
                    "code": "7994",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "西乡",
                    "code": "7995",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "勉县",
                    "code": "7996",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宁强",
                    "code": "7997",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "略阳",
                    "code": "7998",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "镇巴",
                    "code": "7999",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "留坝",
                    "code": "8001",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "佛坪",
                    "code": "8002",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "安康",
                    "code": "8010",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "汉阴",
                    "code": "8012",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "石泉",
                    "code": "8013",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宁陕",
                    "code": "8014",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "紫阳",
                    "code": "8015",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "岚皋",
                    "code": "8016",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "平利",
                    "code": "8017",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "镇坪",
                    "code": "8018",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "旬阳",
                    "code": "8019",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "白河",
                    "code": "8021",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "商洛",
                    "code": "8030",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "洛南",
                    "code": "8032",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "丹凤",
                    "code": "8033",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "商南",
                    "code": "8034",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "山阳",
                    "code": "8035",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "镇安",
                    "code": "8036",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "柞水",
                    "code": "8037",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "延安",
                    "code": "8040",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "延长",
                    "code": "8042",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "延川",
                    "code": "8043",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "子长",
                    "code": "8044",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "安塞",
                    "code": "8045",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "志丹",
                    "code": "8046",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "吴起",
                    "code": "8047",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "甘泉",
                    "code": "8048",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "富县",
                    "code": "8049",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "洛川",
                    "code": "8051",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宜川",
                    "code": "8052",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "黄龙",
                    "code": "8053",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "黄陵",
                    "code": "8054",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "榆林",
                    "code": "8060",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "神木",
                    "code": "8062",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "府谷",
                    "code": "8063",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "横山",
                    "code": "8064",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "靖边",
                    "code": "8065",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "定边",
                    "code": "8066",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "绥德",
                    "code": "8067",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "米脂",
                    "code": "8068",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "佳县",
                    "code": "8069",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "吴堡",
                    "code": "8071",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "清涧",
                    "code": "8072",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "子洲",
                    "code": "8073",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                }
            ]
        },
        {
            "name": "甘肃",
            "code": "8200",
            "sub": [
                {
                    "name": "兰州",
                    "code": "8210",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "永登",
                    "code": "8211",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "皋兰",
                    "code": "8212",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "榆中",
                    "code": "8213",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "嘉峪关",
                    "code": "8220",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "金昌",
                    "code": "8230",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "永昌",
                    "code": "8231",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "白银",
                    "code": "8240",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "靖远",
                    "code": "8241",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "会宁",
                    "code": "8242",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "景泰",
                    "code": "8243",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "天水",
                    "code": "8250",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "清水",
                    "code": "8251",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "秦安",
                    "code": "8252",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "甘谷",
                    "code": "8253",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "武山",
                    "code": "8254",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "张家川回族自治",
                    "code": "8255",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "酒泉",
                    "code": "8260",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "玉门",
                    "code": "8261",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "敦煌",
                    "code": "8263",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "金塔",
                    "code": "8264",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "肃北蒙古族自治",
                    "code": "8265",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阿克塞哈萨克族自治",
                    "code": "8266",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "瓜州",
                    "code": "8267",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "张掖",
                    "code": "8270",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "肃南裕固族自治",
                    "code": "8272",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "民乐",
                    "code": "8273",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "临泽",
                    "code": "8274",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "高台",
                    "code": "8275",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "山丹",
                    "code": "8276",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "武威",
                    "code": "8280",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "民勤",
                    "code": "8282",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "古浪",
                    "code": "8283",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "天祝藏族自治",
                    "code": "8284",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "定西",
                    "code": "8290",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "通渭",
                    "code": "8292",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "陇西",
                    "code": "8293",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "渭源",
                    "code": "8294",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "临洮",
                    "code": "8295",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "漳县",
                    "code": "8296",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "岷县",
                    "code": "8297",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "陇南",
                    "code": "8310",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宕昌",
                    "code": "8312",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "成县",
                    "code": "8313",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "康县",
                    "code": "8314",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "文县",
                    "code": "8315",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "西和",
                    "code": "8316",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "礼县",
                    "code": "8317",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "两当",
                    "code": "8318",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "徽县",
                    "code": "8319",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "平凉",
                    "code": "8330",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "泾川",
                    "code": "8332",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "灵台",
                    "code": "8333",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "崇信",
                    "code": "8334",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "华亭",
                    "code": "8335",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "庄浪",
                    "code": "8336",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "静宁",
                    "code": "8337",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "庆阳",
                    "code": "8340",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "庆城",
                    "code": "8342",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "环县",
                    "code": "8343",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "华池",
                    "code": "8344",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "合水",
                    "code": "8345",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "正宁",
                    "code": "8346",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宁县",
                    "code": "8347",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "镇原",
                    "code": "8348",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "临夏回族自治州",
                    "code": "8360",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "临夏",
                    "code": "8361",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "临夏",
                    "code": "8362",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "康乐",
                    "code": "8363",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "永靖",
                    "code": "8364",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "广河",
                    "code": "8365",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "和政",
                    "code": "8366",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "东乡族自治",
                    "code": "8367",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "积石山保安族东乡族撒拉族自治",
                    "code": "8368",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "甘南藏族自治州",
                    "code": "8380",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "临潭",
                    "code": "8381",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "卓尼",
                    "code": "8382",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "舟曲",
                    "code": "8383",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "迭部",
                    "code": "8384",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "玛曲",
                    "code": "8385",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "碌曲",
                    "code": "8386",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "夏河",
                    "code": "8387",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "合作",
                    "code": "8388",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                }
            ]
        },
        {
            "name": "宁夏回族自治区",
            "code": "8700",
            "sub": [
                {
                    "name": "银川",
                    "code": "8710",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "海原",
                    "code": "8752",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "贺兰",
                    "code": "8712",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "灵武",
                    "code": "8713",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "石嘴山",
                    "code": "8720",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "平罗",
                    "code": "8721",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "吴忠",
                    "code": "8730",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "青铜峡",
                    "code": "8732",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "盐池",
                    "code": "8736",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "同心",
                    "code": "8737",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "固原",
                    "code": "8740",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "西吉",
                    "code": "8743",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "隆德",
                    "code": "8744",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "泾源",
                    "code": "8745",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "彭阳",
                    "code": "8746",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "中卫",
                    "code": "8750",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "中宁",
                    "code": "8751",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "永宁",
                    "code": "8711",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                }
            ]
        },
        {
            "name": "新疆维吾尔自治区",
            "code": "8800",
            "sub": [
                {
                    "name": "乌鲁木齐",
                    "code": "8810",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "乌鲁木齐",
                    "code": "8811",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "克拉玛依",
                    "code": "8820",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "吐鲁番地区",
                    "code": "8830",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "吐鲁番",
                    "code": "8831",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "鄯善",
                    "code": "8832",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "托克逊",
                    "code": "8833",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "哈密地区",
                    "code": "8840",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "哈密",
                    "code": "8841",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "巴里坤哈萨克自治",
                    "code": "8842",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "伊吾",
                    "code": "8843",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "昌吉回族自治州",
                    "code": "8850",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "昌吉",
                    "code": "8851",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "呼图壁",
                    "code": "8853",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "玛纳斯",
                    "code": "8854",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "奇台",
                    "code": "8855",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阜康",
                    "code": "8856",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "吉木萨尔",
                    "code": "8857",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "木垒哈萨克自治",
                    "code": "8858",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "博尔塔拉蒙古族自治州",
                    "code": "8870",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "博乐",
                    "code": "8871",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "精河",
                    "code": "8872",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "温泉",
                    "code": "8873",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "巴音郭楞蒙古自治州",
                    "code": "8880",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "库尔勒",
                    "code": "8881",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "轮台",
                    "code": "8882",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "尉犁",
                    "code": "8883",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "若羌",
                    "code": "8884",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "且末",
                    "code": "8885",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "焉耆回族自治",
                    "code": "8886",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "和静",
                    "code": "8887",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "和硕",
                    "code": "8888",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "博湖",
                    "code": "8889",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阿克苏地区",
                    "code": "8910",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阿克苏",
                    "code": "8911",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "温宿",
                    "code": "8912",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "库车",
                    "code": "8913",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "沙雅",
                    "code": "8914",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "新和",
                    "code": "8915",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "拜城",
                    "code": "8916",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "乌什",
                    "code": "8917",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阿瓦提",
                    "code": "8918",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "柯坪",
                    "code": "8919",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "克孜勒苏柯尔克孜自治州",
                    "code": "8930",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阿图什",
                    "code": "8931",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阿克陶",
                    "code": "8932",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阿合奇",
                    "code": "8933",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "乌恰",
                    "code": "8934",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "喀什地区",
                    "code": "8940",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "喀什",
                    "code": "8941",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "疏附",
                    "code": "8942",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "疏勒",
                    "code": "8943",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "英吉沙",
                    "code": "8944",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "泽普",
                    "code": "8945",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "莎车",
                    "code": "8946",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "叶城",
                    "code": "8947",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "麦盖提",
                    "code": "8948",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "岳普湖",
                    "code": "8949",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "伽师",
                    "code": "8951",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "巴楚",
                    "code": "8952",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "塔什库尔干塔吉克自治",
                    "code": "8953",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "和田地区",
                    "code": "8960",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "和田",
                    "code": "8961",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "和田",
                    "code": "8962",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "墨玉",
                    "code": "8963",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "皮山",
                    "code": "8964",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "洛浦",
                    "code": "8965",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "策勒",
                    "code": "8966",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "于田",
                    "code": "8967",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "民丰",
                    "code": "8968",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "伊犁哈萨克自治州",
                    "code": "8980",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "奎屯",
                    "code": "8981",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "伊宁",
                    "code": "8991",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "伊宁",
                    "code": "8992",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "察布查尔锡伯自治",
                    "code": "8993",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "霍城",
                    "code": "8994",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "巩留",
                    "code": "8995",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "新源",
                    "code": "8996",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "昭苏",
                    "code": "8997",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "特克斯",
                    "code": "8998",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "尼勒克",
                    "code": "8999",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "塔城地区",
                    "code": "9010",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "塔城",
                    "code": "9011",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "额敏",
                    "code": "9012",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "乌苏",
                    "code": "9013",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "沙湾",
                    "code": "9014",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "托里",
                    "code": "9015",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "裕民",
                    "code": "9016",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "和布克赛尔蒙古自治",
                    "code": "9017",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阿勒泰地区",
                    "code": "9020",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阿勒泰",
                    "code": "9021",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "布尔津",
                    "code": "9022",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "富蕴",
                    "code": "9023",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "福海",
                    "code": "9024",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "哈巴河",
                    "code": "9025",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "青河",
                    "code": "9026",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "吉木乃",
                    "code": "9027",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "石河子",
                    "code": "9028",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阿拉尔",
                    "code": "9041",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "图木舒克",
                    "code": "9042",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "五家渠",
                    "code": "9043",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                }
            ]
        },
        {
            "name": "重庆",
            "code": "50",
            "sub": [
                {
                    "name": "重庆",
                    "code": "6900",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                }
            ]
        },
        {
            "name": "天津",
            "code": "12",
            "sub": [
                {
                    "name": "天津",
                    "code": "1100",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                }
            ]
        },
        {
            "name": "上海",
            "code": "38",
            "sub": [
                {
                    "name": "上海",
                    "code": "2900",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                }
            ]
        },
        {
            "name": "河北",
            "code": "1200",
            "sub": [
                {
                    "name": "石家庄",
                    "code": "1210",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "井陉",
                    "code": "1211",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "鹿泉",
                    "code": "1212",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "正定",
                    "code": "1213",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "栾城",
                    "code": "1214",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "辛集",
                    "code": "1221",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "晋州",
                    "code": "1222",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "深泽",
                    "code": "1223",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "无极",
                    "code": "1224",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "藁城",
                    "code": "1225",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "赵县",
                    "code": "1226",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "新乐",
                    "code": "1227",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "高邑",
                    "code": "1228",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "元氏",
                    "code": "1229",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "赞皇",
                    "code": "1231",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "平山",
                    "code": "1232",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "灵寿",
                    "code": "1233",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "行唐",
                    "code": "1234",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "唐山",
                    "code": "1240",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "滦县",
                    "code": "1243",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "滦南",
                    "code": "1244",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "乐亭",
                    "code": "1245",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "迁安",
                    "code": "1246",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "迁西",
                    "code": "1247",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "遵化",
                    "code": "1248",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "玉田",
                    "code": "1249",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "曹妃甸区",
                    "code": "1251",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "秦皇岛",
                    "code": "1260",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "青龙满族自治",
                    "code": "1261",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "昌黎",
                    "code": "1262",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "抚宁",
                    "code": "1263",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "卢龙",
                    "code": "1264",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "邯郸",
                    "code": "1270",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "邯郸",
                    "code": "1271",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "大名",
                    "code": "1281",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "魏县",
                    "code": "1282",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "曲周",
                    "code": "1283",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "邱县",
                    "code": "1284",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "鸡泽",
                    "code": "1285",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "肥乡",
                    "code": "1286",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "广平",
                    "code": "1287",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "成安",
                    "code": "1288",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "临漳",
                    "code": "1289",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "磁县",
                    "code": "1291",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "涉县",
                    "code": "1292",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "永年",
                    "code": "1293",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "馆陶",
                    "code": "1294",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "武安",
                    "code": "1295",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "邢台",
                    "code": "1310",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "邢台",
                    "code": "1311",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "南宫",
                    "code": "1321",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "沙河",
                    "code": "1322",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "临城",
                    "code": "1323",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "内丘",
                    "code": "1324",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "柏乡",
                    "code": "1325",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "隆尧",
                    "code": "1326",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "任县",
                    "code": "1327",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "南和",
                    "code": "1328",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宁晋",
                    "code": "1329",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "巨鹿",
                    "code": "1331",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "新河",
                    "code": "1332",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "广宗",
                    "code": "1333",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "平乡",
                    "code": "1334",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "威县",
                    "code": "1335",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "清河",
                    "code": "1336",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "临西",
                    "code": "1337",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "保定",
                    "code": "1340",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "满城",
                    "code": "1341",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "清苑",
                    "code": "1342",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "定州",
                    "code": "1351",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "涿州",
                    "code": "1352",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "易县",
                    "code": "1353",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "徐水",
                    "code": "1354",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "涞源",
                    "code": "1355",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "定兴",
                    "code": "1356",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "顺平",
                    "code": "1357",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "唐县",
                    "code": "1358",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "望都",
                    "code": "1359",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "涞水",
                    "code": "1361",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "高阳",
                    "code": "1362",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "安新",
                    "code": "1363",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "雄县",
                    "code": "1364",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "容城",
                    "code": "1365",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "高碑店",
                    "code": "1366",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "曲阳",
                    "code": "1367",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阜平",
                    "code": "1368",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "安国",
                    "code": "1369",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "博野",
                    "code": "1371",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "蠡县",
                    "code": "1372",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "张家口",
                    "code": "1380",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宣化",
                    "code": "1381",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "张北",
                    "code": "1391",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "康保",
                    "code": "1392",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "沽源",
                    "code": "1393",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "尚义",
                    "code": "1394",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "蔚县",
                    "code": "1395",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阳原",
                    "code": "1396",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "怀安",
                    "code": "1397",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "万全",
                    "code": "1398",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "怀来",
                    "code": "1399",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "涿鹿",
                    "code": "1401",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "赤城",
                    "code": "1402",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "崇礼",
                    "code": "1403",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "承德",
                    "code": "1410",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "承德",
                    "code": "1411",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宽城满族自治",
                    "code": "1421",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "兴隆",
                    "code": "1422",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "平泉",
                    "code": "1423",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "滦平",
                    "code": "1424",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "丰宁满族自治",
                    "code": "1425",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "隆化",
                    "code": "1426",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "围场满族蒙古族自治",
                    "code": "1427",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "沧州",
                    "code": "1430",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "沧县",
                    "code": "1431",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "青县",
                    "code": "1432",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "泊头",
                    "code": "1441",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "任丘",
                    "code": "1442",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "河间",
                    "code": "1443",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "肃宁",
                    "code": "1444",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "献县",
                    "code": "1445",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "吴桥",
                    "code": "1446",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "东光",
                    "code": "1447",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "南皮",
                    "code": "1448",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "盐山",
                    "code": "1449",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "黄骅",
                    "code": "1451",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "孟村回族自治",
                    "code": "1452",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "海兴",
                    "code": "1453",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "廊坊",
                    "code": "1460",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "三河",
                    "code": "1461",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "固安",
                    "code": "1462",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "永清",
                    "code": "1463",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "香河",
                    "code": "1464",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "大城",
                    "code": "1465",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "文安",
                    "code": "1466",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "霸州",
                    "code": "1467",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "大厂回族自治",
                    "code": "1468",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "衡水",
                    "code": "1480",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "冀州",
                    "code": "1482",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "枣强",
                    "code": "1483",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "武邑",
                    "code": "1484",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "深州",
                    "code": "1485",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "武强",
                    "code": "1486",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "饶阳",
                    "code": "1487",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "安平",
                    "code": "1488",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "故城",
                    "code": "1489",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "景县",
                    "code": "1491",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阜城",
                    "code": "1492",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                }
            ]
        },
        {
            "name": "山西",
            "code": "1600",
            "sub": [
                {
                    "name": "太原",
                    "code": "1610",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "清徐",
                    "code": "1611",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阳曲",
                    "code": "1612",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "娄烦",
                    "code": "1613",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "古交",
                    "code": "1614",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "大同",
                    "code": "1620",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阳高",
                    "code": "1631",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "天镇",
                    "code": "1632",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "广灵",
                    "code": "1633",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "灵丘",
                    "code": "1634",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "浑源",
                    "code": "1635",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "左云",
                    "code": "1637",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "大同",
                    "code": "1639",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阳泉",
                    "code": "1650",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "平定",
                    "code": "1651",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "盂县",
                    "code": "1652",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "长治",
                    "code": "1660",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "长治",
                    "code": "1661",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "潞城",
                    "code": "1662",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "襄垣",
                    "code": "1663",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "屯留",
                    "code": "1664",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "平顺",
                    "code": "1665",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "黎城",
                    "code": "1666",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "壶关",
                    "code": "1667",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "长子",
                    "code": "1668",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "武乡",
                    "code": "1669",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "沁县",
                    "code": "1671",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "沁源",
                    "code": "1672",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "晋城",
                    "code": "1680",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "沁水",
                    "code": "1681",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "阳城",
                    "code": "1682",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "高平",
                    "code": "1683",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "陵川",
                    "code": "1684",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "泽州",
                    "code": "1685",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "朔州",
                    "code": "1690",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "山阴",
                    "code": "1691",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "应县",
                    "code": "1692",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "右玉",
                    "code": "1693",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "怀仁",
                    "code": "1694",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "忻州",
                    "code": "1710",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "定襄",
                    "code": "1712",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "五台",
                    "code": "1713",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "原平",
                    "code": "1714",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "代县",
                    "code": "1715",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "繁峙",
                    "code": "1716",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "宁武",
                    "code": "1717",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "静乐",
                    "code": "1718",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "神池",
                    "code": "1719",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "五寨",
                    "code": "1721",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "岢岚",
                    "code": "1722",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "河曲",
                    "code": "1723",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "保德",
                    "code": "1724",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "偏关",
                    "code": "1725",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "吕梁",
                    "code": "1730",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "汾阳",
                    "code": "1731",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "文水",
                    "code": "1732",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "交城",
                    "code": "1733",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "孝义",
                    "code": "1734",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "兴县",
                    "code": "1735",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "临县",
                    "code": "1736",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "柳林",
                    "code": "1737",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "石楼",
                    "code": "1738",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "岚县",
                    "code": "1739",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "方山",
                    "code": "1741",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "中阳",
                    "code": "1743",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "交口",
                    "code": "1744",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "晋中",
                    "code": "1750",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "榆社",
                    "code": "1752",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "左权",
                    "code": "1753",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "和顺",
                    "code": "1754",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "昔阳",
                    "code": "1755",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "寿阳",
                    "code": "1756",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "太谷",
                    "code": "1757",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "祁县",
                    "code": "1758",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "平遥",
                    "code": "1759",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "介休",
                    "code": "1761",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "灵石",
                    "code": "1762",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "临汾",
                    "code": "1770",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "侯马",
                    "code": "1772",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "曲沃",
                    "code": "1773",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "翼城",
                    "code": "1774",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "襄汾",
                    "code": "1775",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "洪洞",
                    "code": "1776",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "霍州",
                    "code": "1777",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "古县",
                    "code": "1778",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "安泽",
                    "code": "1779",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "浮山",
                    "code": "1781",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "吉县",
                    "code": "1782",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "乡宁",
                    "code": "1783",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "蒲县",
                    "code": "1784",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "大宁",
                    "code": "1785",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "永和",
                    "code": "1786",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "隰县",
                    "code": "1787",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "汾西",
                    "code": "1788",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "运城",
                    "code": "1810",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "永济",
                    "code": "1812",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "芮城",
                    "code": "1813",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "临猗",
                    "code": "1814",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "万荣",
                    "code": "1815",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "新绛",
                    "code": "1816",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "稷山",
                    "code": "1817",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "河津",
                    "code": "1818",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "闻喜",
                    "code": "1819",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "夏县",
                    "code": "1821",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "绛县",
                    "code": "1822",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "平陆",
                    "code": "1823",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                },
                {
                    "name": "垣曲",
                    "code": "1824",
                    "sub": [
                        {
                            "name": "测试",
                            "code": "12345"
                        }
                    ]
                }
            ]
        }
    ];
}($);
// jshint ignore: end

/* global $:true */
/* jshint unused:false*/

+function ($) {
    "use strict";

    var defaults;
    var raw = $.rawCitiesData;

    var format = function (data) {
        var result = [];
        for (var i = 0; i < data.length; i++) {
            var d = data[i];
            if (/^请选择|市辖区/.test(d.name)) continue;
            result.push(d);
        }
        if (result.length) return result;
        return [];
    };

    var sub = function (data) {
        if (!data.sub) return [{name: '', code: data.code}];  // 有可能某些县级市没有区
        return format(data.sub);
    };

    var getCities = function (d) {
        for (var i = 0; i < raw.length; i++) {
            if (raw[i].code === d || raw[i].name === d) return sub(raw[i]);
        }
        return [];
    };

    var getDistricts = function (p, c) {
        for (var i = 0; i < raw.length; i++) {
            if (raw[i].code === p || raw[i].name === p) {
                for (var j = 0; j < raw[i].sub.length; j++) {
                    if (raw[i].sub[j].code === c || raw[i].sub[j].name === c) {
                        return sub(raw[i].sub[j]);
                    }
                }
            }
        }
    };

    var parseInitValue = function (val) {
        var p = raw[0], c, d;
        var tokens = val.split(' ');
        raw.map(function (t) {
            if (t.name === tokens[0]) p = t;
        });

        p.sub.map(function (t) {
            if (t.name === tokens[1]) c = t;
        })

        if (tokens[2]) {
            c.sub.map(function (t) {
                if (t.name === tokens[2]) d = t;
            })
        }

        if (d) return [p.code, c.code, d.code];
        return [p.code, c.code];
    }

    $.fn.cityPicker = function (params) {
        params = $.extend({}, defaults, params);
        return this.each(function () {
            var self = this;

            var provincesName = raw.map(function (d) {
                return d.name;
            });
            var provincesCode = raw.map(function (d) {
                return d.code;
            });
            var initCities = sub(raw[0]);
            var initCitiesName = initCities.map(function (c) {
                return c.name;
            });
            var initCitiesCode = initCities.map(function (c) {
                return c.code;
            });
            var initDistricts = sub(raw[0].sub[0]);

            var initDistrictsName = initDistricts.map(function (c) {
                return c.name;
            });
            var initDistrictsCode = initDistricts.map(function (c) {
                return c.code;
            });

            var currentProvince = provincesName[0];
            var currentCity = initCitiesName[0];
            var currentDistrict = initDistrictsName[0];

            var cols = [
                {
                    displayValues: provincesName,
                    values: provincesCode,
                    cssClass: "col-province"
                },
                {
                    displayValues: initCitiesName,
                    values: initCitiesCode,
                    cssClass: "col-city"
                }
            ];

            if (params.showDistrict) cols.push({
                values: initDistrictsCode,
                displayValues: initDistrictsName,
                cssClass: "col-district"
            });

            var config = {

                cssClass: "city-picker",
                rotateEffect: false,  //为了性能
                formatValue: function (p, values, displayValues) {
                    return displayValues.join(' ');
                },
                onChange: function (picker, values, displayValues) {
                    var newProvince = picker.cols[0].displayValue;
                    var newCity;
                    if (newProvince !== currentProvince) {
                        var newCities = getCities(newProvince);
                        newCity = newCities[0].name;
                        var newDistricts = getDistricts(newProvince, newCity);
                        picker.cols[1].replaceValues(newCities.map(function (c) {
                            return c.code;
                        }), newCities.map(function (c) {
                            return c.name;
                        }));
                        if (params.showDistrict) picker.cols[2].replaceValues(newDistricts.map(function (d) {
                            return d.code;
                        }), newDistricts.map(function (d) {
                            return d.name;
                        }));
                        currentProvince = newProvince;
                        currentCity = newCity;
                        picker.updateValue();
                        return false; // 因为数据未更新完，所以这里不进行后序的值的处理
                    } else {
                        if (params.showDistrict) {
                            newCity = picker.cols[1].displayValue;
                            if (newCity !== currentCity) {
                                var districts = getDistricts(newProvince, newCity);
                                picker.cols[2].replaceValues(districts.map(function (d) {
                                    return d.code;
                                }), districts.map(function (d) {
                                    return d.name;
                                }));
                                currentCity = newCity;
                                picker.updateValue();
                                return false; // 因为数据未更新完，所以这里不进行后序的值的处理
                            }
                        }
                    }
                    //如果最后一列是空的，那么取倒数第二列
                    var len = (values[values.length - 1] ? values.length - 1 : values.length - 2)
                    $(self).attr('data-code', values[len]);
                    $(self).attr('data-codes', values.join(','));
                    if (params.onChange) {
                        params.onChange.call(self, picker, values, displayValues);
                    }
                },

                cols: cols
            };

            if (!this) return;
            var p = $.extend({}, params, config);
            //计算value
            var val = $(this).val();
            if (!val) val = '北京 北京 测试';
            currentProvince = val.split(" ")[0];
            currentCity = val.split(" ")[1];
            currentDistrict = val.split(" ")[2];
            if (val) {
                p.value = parseInitValue(val);
                if (p.value[0]) {
                    var cities = getCities(p.value[0]);
                    p.cols[1].values = cities.map(function (c) {
                        return c.code;
                    });
                    p.cols[1].displayValues = cities.map(function (c) {
                        return c.name;
                    });
                }

                if (p.value[1]) {
                    if (params.showDistrict) {
                        var dis = getDistricts(p.value[0], p.value[1]);
                        p.cols[2].values = dis.map(function (d) {
                            return d.code;
                        });
                        p.cols[2].displayValues = dis.map(function (d) {
                            return d.name;
                        });
                    }
                } else {
                    if (params.showDistrict) {
                        var dis = getDistricts(p.value[0], p.cols[1].values[0]);
                        p.cols[2].values = dis.map(function (d) {
                            return d.code;
                        });
                        p.cols[2].displayValues = dis.map(function (d) {
                            return d.name;
                        });
                    }
                }
            }
            $(this).picker(p);
        });
    };

    defaults = $.fn.cityPicker.prototype.defaults = {
        showDistrict: true //是否显示地区选择
    };

}($);
